[
    {
        "description": "The headline of the report is Fisherman has night time sighting along dirt road east of Scranton Lake. The State of this location is the Kansas. State, the County is the Osage. County, the location details are described as The town of Scrantons old water supply. It used to be called Scranton Lake. East of the City of Scranton. I believe the Lake is now privately owned.. and, the nearest town is Scranton. and the nearest road is Highway 75."
    },
    {
        "description": "The headline of the report is Snowmobiler finds large barefoot tracks in upper peninsula of Michigan. The State of this location is the Michigan. State, the County is the Luce. County, the location details are described as To the best of my knowledge, the incident occured. and, the nearest town is Newberry. and the nearest road is Co. rd. 462."
    },
    {
        "description": "The headline of the report is Nighttime sighting by motorist near Land O'Lakes. The State of this location is the Florida. State, the County is the Pasco. County, the location details are described as about 2 miles before pine view middle school facing ehren cutoff. and, the nearest town is Land O Lakes. and the nearest road is parkway and erhen cutoff."
    },
    {
        "description": "The headline of the report is Memory told of possible vocalizations and footprints found near Atwood. The State of this location is the Illinois. State, the County is the Piatt. County, the location details are described as Exact locations provided in the report.. and, the nearest town is Atwood. and the nearest road is E 300 N Rd & CR 1425."
    },
    {
        "description": "The headline of the report is Daughter and Mother both observe a large dark creature in the Klamath River bottom. The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as It was along Hwy 96, in between Orleans and Happy Camp CA.. and, the nearest town is Orleans. and the nearest road is Hwy 96 at the Independence Bridge.."
    },
    {
        "description": "The headline of the report is Close roadside encounter of juvenile biped animal near South Haven. The State of this location is the Kansas. State, the County is the Sumner. County, the location details are described as I-35, Under an overpass wherein the very next (southbound exit) has a convenience store and tow-truck station (east side of I-35). and, the nearest town is South Haven. and the nearest road is I-35 & Kansas 166."
    },
    {
        "description": "The headline of the report is A man is woken by a whoop near his home and a few months later sees an upright creature run past his barn. The State of this location is the Minnesota. State, the County is the Pine. County, the location details are described as North of what is now the airport.. and, the nearest town is Hinckley. and the nearest road is hwy 48."
    },
    {
        "description": "The headline of the report is Memory told of an early morning road crossing near Nixon. The State of this location is the Texas. State, the County is the Gonzales. County, the location details are described as Northwest three to five miles on Farm Road1117 leaving Nixon, Texas.  House with large, very distinct lamposts will be passed just prior to the site.. and, the nearest town is Nixon. and the nearest road is FM 1117."
    },
    {
        "description": "The headline of the report is Man recalls a late night encounter while parking in a remote area north of Splendora. The State of this location is the Texas. State, the County is the Liberty. County, the location details are described as East of Highway 59 about 5 miles north of Splendora and 4 or so miles south of Cleveland. Not sure of the name of the road.. and, the nearest town is Splendora. and the nearest road is Highway 59."
    },
    {
        "description": "The headline of the report is Man describes encounter at a strip mine near Whitesburg. The State of this location is the Kentucky. State, the County is the Letcher. County, the location details are described as It was so long ago that I cannot even be sure of what town,or hwy was the closest.. and, the nearest town is Whitesburg. and the nearest road is ?."
    },
    {
        "description": "The headline of the report is Night time sighting by motorist in Feather River Canyon near Hwy 70 & 89 intersection. The State of this location is the California. State, the County is the Plumas. County, the location details are described as 1/4 mile south on hiway 70 from the intersection of 70 and 89. There is a house on the turn and i though the animal might have come out of the driveway.. and, the nearest town is Greenville. and the nearest road is Hiway 70."
    },
    {
        "description": "The headline of the report is Midday observation by young hunters near Glasford. The State of this location is the Illinois. State, the County is the Fulton. County, the location details are described as i really dont know how to give you directions to it it is pretty much in the woods and would really have to show you. and we would have to find out who owns it now and get permission noone nos we seen this back there. and, the nearest town is Glasford. and the nearest road is North Bitner Rd.."
    },
    {
        "description": "The headline of the report is Canoers report a rock throw and possible grunts near Grand Marais. The State of this location is the Minnesota. State, the County is the Cook. County, the location details are described as nan. and, the nearest town is Grand Marais. and the nearest road is The Arrowhead Trail."
    },
    {
        "description": "The headline of the report is Vocalizations heard and rocks thrown at fisherman and family on Blue River. The State of this location is the Indiana. State, the County is the Crawford. County, the location details are described as South of Hwy 150, on Blue River a few miles west of Fredricksburg, IN off of S. Sheppard road. I can drive there but I don't think I could give you adequate directions.. and, the nearest town is Fredricksburg. and the nearest road is S. Shepard road off Hwy 150."
    },
    {
        "description": "The headline of the report is The Georgia chopper crash story has been debunked. See msg from P. Caulkins in the investigator notes. The State of this location is the Georgia. State, the County is the Fannin. County, the location details are described as The location was northwest of Dalonega, Ga about 5-6 miles in the Chatahoochee Forest, 4 miles north of Camp Darby [Camp Frank D. Merrill] (US Army Ranger training camp). [The crash site is in the Blue Ridge Wildlife Refuge] The main N - S Park access (dirt and gravel) road was about two miles from the location. The Park starts about 1/2 mile north of Camp Darby and the access road is the road from Darby into the Park - follow this road for about 2 miles and take the right (north) fork. About 2-3 miles north of the fork and on the west side of the road is a large mountain (I dont know the name of it, and was probably only known as a number on the military maps, however I do not recall what it is) the incident occured near a ridge, about 1/3 of the way up mountain. If I had a military map of the area I could show you the exact location.. and, the nearest town is Dalonega. and the nearest road is state park access road about 2 miles away."
    },
    {
        "description": "The headline of the report is A family is shocked to see a large, hairy creature run across a forest road with a pack of dogs in pursuit. The State of this location is the Ohio. State, the County is the Vinton. County, the location details are described as Take State Route 160 out of Hamden and go east for about a 10 minute drive. You'll pass State Route 324 as you are going. Then there will be a gravel road on the left hand side that says Experimental Forest road. You turn left on it. go straight and you'll come to fork in the road,and take the middle road for about three to four minutes and you will be there.. and, the nearest town is Dundas. and the nearest road is State Route 160."
    },
    {
        "description": "The headline of the report is   Calif. Del Norte County Jed Smith Park. The State of this location is the California. State, the County is the Del Norte. County, the location details are described as just across the Smith River from the Jedediah Smith Redwoods State Park campground. and, the nearest town is Hiouchi (near Crescent City). and the nearest road is Hwy. 199."
    },
    {
        "description": "The headline of the report is Possible screams heard by fishermen near Lake Hopatcong. The State of this location is the New Jersey. State, the County is the Sussex. County, the location details are described as nan. and, the nearest town is Northwood Andover Hopatcong. and the nearest road is Maxim Dr.."
    },
    {
        "description": "The headline of the report is Road crossing sighting by two witnesses on Hwy 175 between Many and Pleasant Hill. The State of this location is the Louisiana. State, the County is the Sabine. County, the location details are described as It was huge had dark brown hair. It was gone in one step. It disappeared in the trees.. and, the nearest town is Many louisiana. and the nearest road is 175."
    },
    {
        "description": "The headline of the report is creature screamed twice. The State of this location is the Michigan. State, the County is the Benzie. County, the location details are described as The experience took place on the Betsie River from SR 115 to the next 115 bridge west near Benzonia in Benzie Co. MI.. and, the nearest town is Benzonia. and the nearest road is SR 115."
    },
    {
        "description": "The headline of the report is Rock banging, footprints and strange stripped tree on high mountain ranch near Sandpoint. The State of this location is the Idaho. State, the County is the Bonner. County, the location details are described as On our remote 25 acre ranch in the mountains (Selkirk),just at the end of a primitive airstrip currently under construction. We have lived on this ranch for 25 years now.. and, the nearest town is Sandpoint,idaho. and the nearest road is Baldy Mtn. Rd.."
    },
    {
        "description": "The headline of the report is Knocks and whooping sounds heard north of Clint's Well. The State of this location is the Arizona. State, the County is the Coconino. County, the location details are described as Five miles north of hwy 87 and 3 miles west of Lake Mary Road.. and, the nearest town is Strawberry Az.. and the nearest road is Hwy 87 and Lake Mary Road.."
    },
    {
        "description": "The headline of the report is Deer hunters have close sighting along Dry Fork Creek. The State of this location is the Illinois. State, the County is the Bond. County, the location details are described as Three miles south of Sorento,  along Dry Fork Creek bottoms.. and, the nearest town is Sorento. and the nearest road is Old Ripley Trail."
    },
    {
        "description": "The headline of the report is Possible daytime road-crossing by a juvenile outside Esto. The State of this location is the Florida. State, the County is the Holmes. County, the location details are described as Directions are for you study, not internet-. and, the nearest town is Esto. and the nearest road is FL Hwy. 2."
    },
    {
        "description": "The headline of the report is Man observes a large, hair-covered biped outside his garage south of Nashville. The State of this location is the Georgia. State, the County is the Berrien. County, the location details are described as nan. and, the nearest town is Nashville. and the nearest road is Old Valdosta Highway."
    },
    {
        "description": "The headline of the report is Drain pipes knocked down after strange howls/screams were heard. The State of this location is the West Virginia. State, the County is the Marion. County, the location details are described as USA, West Virginia, Marion County. Two miles west of the town of Mannington on Route 250 commonly known as Whetstone Road.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two children discover small footprints frozen on the surface of a creek near Jackson. . The State of this location is the Kentucky. State, the County is the Breathitt. County, the location details are described as Turn off highway 15 toward Lost Creek about 8 miles.. and, the nearest town is Jackson. and the nearest road is not sure of the number it ran through lost creek."
    },
    {
        "description": "The headline of the report is Man has a close daytime encounter with a probable Bigfoot family outside Hardy. The State of this location is the Arkansas. State, the County is the Fulton. County, the location details are described as IT WAS ON WHITE HORSE MT. GRAVEL ROADS DON'T KNOW THE NAMES OF THEM WOULD HAVE TO SHOW YOU. and, the nearest town is HARDY. and the nearest road is HWY 63."
    },
    {
        "description": "The headline of the report is Two witnesses have a daylight encounter in their camp near Spring Valley. The State of this location is the Minnesota. State, the County is the Fillmore. County, the location details are described as nan. and, the nearest town is Spring Valley. and the nearest road is County Rd 1 (3 miles away)."
    },
    {
        "description": "The headline of the report is Motorist has a possible daylight sighting just north of South Branch. The State of this location is the Michigan. State, the County is the Ogemaw. County, the location details are described as One mile north of town. and, the nearest town is South Branch. and the nearest road is South Branch."
    },
    {
        "description": "The headline of the report is A daylight sighting near Frazier Park, by a hiker. The State of this location is the California. State, the County is the Kern. County, the location details are described as From Los Angeles,60 miles to Frazier Park. Sheep Camp is on local maps.. and, the nearest town is Frazier Park ,CA.. and the nearest road is highway 33."
    },
    {
        "description": "The headline of the report is Nighttime sighting at City Lake Park outside Sullivan. The State of this location is the Missouri. State, the County is the Crawford. County, the location details are described as The park is right off the second Sullivan exit. Is called the City Lake Park, and it is near heavy forested areas like the Meramec State park, and Mark Twain National Forrest.. and, the nearest town is Sullivan Missouri. and the nearest road is Interstate 44."
    },
    {
        "description": "The headline of the report is Possible tracks found along hiking trail outside Bozeman. The State of this location is the Montana. State, the County is the Gallatin. County, the location details are described as One (1) mile from the Trail Creek trail head.. and, the nearest town is Between Bozeman and Livingston. and the nearest road is Trail Creek Road off I-90."
    },
    {
        "description": "The headline of the report is Chicken pens being raided by unknown thief near Nevada City. The State of this location is the California. State, the County is the Nevada. County, the location details are described as along deer creek. and, the nearest town is Nevada City. and the nearest road is Slate Creek Road."
    },
    {
        "description": "The headline of the report is Daylight sighting interrupts hunters at an old mining area near Earlington. The State of this location is the Kentucky. State, the County is the Hopkins. County, the location details are described as These encounters occurred on the property of the Heckley mines.. and, the nearest town is Earlington. and the nearest road is Near Highway 41,  off of Hecla St. heading North."
    },
    {
        "description": "The headline of the report is Man in the Citico Creek area has an unknown animal circle his camp for several hours. The State of this location is the Tennessee. State, the County is the Loudon. County, the location details are described as From 165 take a right to Indian Boundary campground take the first right before you get to the campground go about four miles on the gravel road,its the first pull off on the right follow the trail for about a mile or so my camp was on the left. and, the nearest town is Tellico Plains. and the nearest road is 165-Cherohala Skyway."
    },
    {
        "description": "The headline of the report is Possible footprint found by a family looking for moose antlers near Wilson Mills. The State of this location is the Maine. State, the County is the Oxford. County, the location details are described as very close to the lake, near a road called Alca Flats or Alca road. and, the nearest town is Wilson Mills, ME/ Errol. and the nearest road is RT 16 Maine."
    },
    {
        "description": "The headline of the report is Incidents around home on Mescalero IR. The State of this location is the New Mexico. State, the County is the Otero. County, the location details are described as Edited by request. and, the nearest town is Mescalero, New Mexico. and the nearest road is Highway 70."
    },
    {
        "description": "The headline of the report is Two bowhunters hear possible screams near Glennie. The State of this location is the Michigan. State, the County is the Alcona. County, the location details are described as Approximately 1 mile west of Stout Road and 1/2 mile south of M-72. and, the nearest town is Barton City. and the nearest road is South of M-72 and west of Stout Road."
    },
    {
        "description": "The headline of the report is Daylight sighting outside rural home in small community of Herbine, south of Rison. The State of this location is the Arkansas. State, the County is the Cleveland. County, the location details are described as Rural Area.. and, the nearest town is Herbine, Arkansas; Rison Arkansas. and the nearest road is Goggans Road (County Road) U.S. Highway 63."
    },
    {
        "description": "The headline of the report is Witness heard stomping and crashing of small trees. . The State of this location is the California. State, the County is the Mendocino. County, the location details are described as nan. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Long term possible Sasquatch interactions on a farm near New Era beginning in the mid 1970's. The State of this location is the Michigan. State, the County is the Oceana. County, the location details are described as nan. and, the nearest town is New Era. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two children have encounter west of Benton. The State of this location is the Arkansas. State, the County is the Saline. County, the location details are described as Just a few miles west of Benton I-30 splits with I-70.  The house is just about a mile from the junction on the right hand side of the road.. and, the nearest town is Benton. and the nearest road is Hwy 70."
    },
    {
        "description": "The headline of the report is Hikers report Sasquatch stalking south of Amherst. The State of this location is the Massachusetts. State, the County is the Hampshire. County, the location details are described as The Seven Sisters is a group of Peaks within the Holyoke Mountain Range.. and, the nearest town is South Hadley/Amherst line. and the nearest road is RT 116."
    },
    {
        "description": "The headline of the report is Dusk sighting by hikers in general vicinity of Tamarack Ski Resort. The State of this location is the Idaho. State, the County is the Valley. County, the location details are described as We were in the forest near our campground doing some hiking when the sighting occurred. and, the nearest town is Cascade. and the nearest road is State highway 55."
    },
    {
        "description": "The headline of the report is Hunter recalls incidents near Pecks Lake. The State of this location is the Michigan. State, the County is the Osceola. County, the location details are described as West of Pecks Lake, next to 55 acres of state land on the South West corner of that properety but not on the state land but on private land just south of that border.. and, the nearest town is Evart. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Witness saw a large man-like figure deep in the woods. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Near sultan basin road.. and, the nearest town is Sultan. and the nearest road is Trout Farm Rd."
    },
    {
        "description": "The headline of the report is Four youths have harrowing experience in Alabama backwoods. . The State of this location is the Alabama. State, the County is the Lee. County, the location details are described as Near a creek that runs through the county called Phelps Creek.. and, the nearest town is Opelika/Auburn area. and the nearest road is 431."
    },
    {
        "description": "The headline of the report is While driving between Trinity River and Cleveland, couple has morning road-cross encounter. The State of this location is the Texas. State, the County is the Liberty. County, the location details are described as Coming from Cleveland, travel East on FM 787 for 12 miles until you pass a green sign saying RAYBURN and the Rayburn Baptists Church.  Looking to the right there will be a pipline trail.  If you come to a steep hill and another sign that says DOLEN, you went too far.. and, the nearest town is Rayburn. and the nearest road is FM 787."
    },
    {
        "description": "The headline of the report is Motorist describes a daylight sighting with other motorists outside Moose Lake. The State of this location is the Minnesota. State, the County is the Carlton. County, the location details are described as nan. and, the nearest town is Moose Lake. and the nearest road is Hwy 73."
    },
    {
        "description": "The headline of the report is Two squirrel hunters have sighting near Shoal Creek. The State of this location is the Illinois. State, the County is the Montgomery. County, the location details are described as About a mile southwest of McPherson bridge.. and, the nearest town is Panama. and the nearest road is country roads."
    },
    {
        "description": "The headline of the report is Hikers have possible daytime encounter on state's highest peak, Mount Greylock. The State of this location is the Massachusetts. State, the County is the Berkshire. County, the location details are described as Mount Greylock State Reservation, Cheshire Harbor Trail off West Mountain Rd, Adams, MA, heading southeast toward base of trail. Adams, MA.. and, the nearest town is Adams. and the nearest road is Cheshire Harbor Trail: Rockwell Rd."
    },
    {
        "description": "The headline of the report is Possible track find in snow, near the town of Sand Lake. The State of this location is the New York. State, the County is the Rensselaer. County, the location details are described as The location was in a well wooded area about 2 miles behind my home and a neghbors property.  The old logging trail is used by friends for hiking, walking etc at all tmes of the year.  It is accessible only by trails across my or my neighbors land.. and, the nearest town is Sand Lake, NY. and the nearest road is County Route 42/Taborton Road."
    },
    {
        "description": "The headline of the report is Woman and friend drive past amazing animal on Georgia backroad . The State of this location is the Georgia. State, the County is the Heard. County, the location details are described as Yellow Jacket Creek..... there is a little store at the entrance and it is about 1 to 2 miles to the lake... Bud could tell you more about the road numbers and names.  I can get Bud's phone number for you to talk to him. You can call me if you'd like. Just let me know. I have tried off and on for the last few years to get some one and tell them what we saw, with no luck.  I tried to call a 1-800 # and it was no longer in service and had to let it go. But it DID happen and I know what I saw. There is also an elderly man in Tucker Ga. who as a young adult was hunting around Yellow Jacket Creek and he made his sister bring him to me, an hour's ride, so we could talk about it. Said no one belived him and he was afraid to tell it. As we talked he started to cry. He had to be 80 at this time but said he remembered it in detail and was so glad that someone else had seen it, that he KNEW he wasn't crazy. This stays on my mind and I hope to hear from someone.. and, the nearest town is West Point Lake. and the nearest road is Went in through the Newnan side."
    },
    {
        "description": "The headline of the report is Possible rock throwing incident while taking photos off of Hwy. 109 near Pacific Beach . The State of this location is the Washington. State, the County is the Grays Harbor. County, the location details are described as nan. and, the nearest town is Pacific Beach, WA. and the nearest road is 109."
    },
    {
        "description": "The headline of the report is Daylight sighting by camper at Black Mountain Campground near Blue Ridge Parkway. The State of this location is the North Carolina. State, the County is the Yancey. County, the location details are described as Pisgah National Forest, Black Mountain Campground. and, the nearest town is Busick, NC. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Possible ongoing activity experienced while hiking a trail outside Gladstone. The State of this location is the Michigan. State, the County is the Delta. County, the location details are described as East on Days River 24.5 Rd from M35 until you reach the Hiking Trail Trailhead. and, the nearest town is Gladstone/Escanaba, MI. and the nearest road is US 41 / Days River Rd. 24.5."
    },
    {
        "description": "The headline of the report is Several incidents experienced by father and son outside St. Louis. The State of this location is the Missouri. State, the County is the St. Louis. County, the location details are described as Missouri river bottoms above river from the 370 hwy bridge. and, the nearest town is St. Charles. and the nearest road is hog hollow road."
    },
    {
        "description": "The headline of the report is Daytime Sighting by Caver West of Lake Monroe. The State of this location is the Indiana. State, the County is the Monroe. County, the location details are described as nan. and, the nearest town is Harrodsburg. and the nearest road is Popcorn Road."
    },
    {
        "description": "The headline of the report is Lone camper hears vocalization. The State of this location is the Oregon. State, the County is the Grant. County, the location details are described as This happened at the Dixie campground, Dixie Pass, in Malheur National Forest.. and, the nearest town is Prairie City. and the nearest road is Hwy 26."
    },
    {
        "description": "The headline of the report is Truck driver spots tall figure on roadside. The State of this location is the Texas. State, the County is the Rusk. County, the location details are described as Mount Enterprise, eastbound Hwy 84.. and, the nearest town is Mount Enterprise. and the nearest road is Hwy 84."
    },
    {
        "description": "The headline of the report is Noon sighting by family of four near Mount Washburn, Yellowstone National Park. The State of this location is the Wyoming. State, the County is the Park. County, the location details are described as It was on a ridge on a road in Mt. Washburn, Wyoming.. and, the nearest town is Canyon Junction, WY - YNP. and the nearest road is Grand Loop Road."
    },
    {
        "description": "The headline of the report is From top of hill, hunter observes bipedal creature following a fence row. The State of this location is the Arkansas. State, the County is the Hot Spring. County, the location details are described as About 2 miles from Caney, Arkansas in Hot Spring County.. and, the nearest town is Caney. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Teen hears extremely loud vocalization along path near home. The State of this location is the Michigan. State, the County is the Mecosta. County, the location details are described as If I had a map of the area I could show you exactly.  However, the area has changed dramatically since this happened and looks very little like the terrain I grew up around at the time.. and, the nearest town is Mecosta. and the nearest road is Buchanan Road."
    },
    {
        "description": "The headline of the report is Possible activity at a home south of Williamsburg. The State of this location is the Ohio. State, the County is the Clermont. County, the location details are described as nan. and, the nearest town is Williamsburg, Ohio. and the nearest road is OH-133."
    },
    {
        "description": "The headline of the report is Bow hunter recalls a small Bigfoot playing peek-a-boo with him east of Grayling. The State of this location is the Michigan. State, the County is the Oscoda. County, the location details are described as East of Grayling and south of Lewiston in the Red Oak area. and, the nearest town is Luzerne. and the nearest road is 489 and Griffin Road."
    },
    {
        "description": "The headline of the report is Man describes history of incidents around his home outside Stanwood. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as BETWEEN INTER-STATE 5 AND STATE HIGHWAY 9. and, the nearest town is STANWOOD, WASHINGTON [Property address removed by MM]. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Young hunter sees an upright walking animal. The State of this location is the Washington. State, the County is the Stevens. County, the location details are described as 1/4 to 1/2 mile W of Lake Roosevelt. 5 miles NW of Old Dominion Mt.. and, the nearest town is Orient. and the nearest road is Gravel road adjoining our property."
    },
    {
        "description": "The headline of the report is Young family on afternoon outing find footprints east of Pendleton, Oregon. The State of this location is the Oregon. State, the County is the Union. County, the location details are described as Upon further discussion with the witness' husband, it was determined that the incident occurred east of Pendleton, OR in Union County.  Witness could not pinpoint location off existing maps due to the many years since the incident.. and, the nearest town is Pendleton, OR. and the nearest road is Highway 104."
    },
    {
        "description": "The headline of the report is Camper has two late night encounters in North Cascades. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as This was in the northern Cascade Mountains. It would be too easy for people who have been there to figure out. And I DO NOT want that to happen. I will explain.I think you will understand.. and, the nearest town is I need this to be kept private please.. and the nearest road is See above (I will explain).."
    },
    {
        "description": "The headline of the report is Night time sighting by two witnesses at trailhead in Shawnee National Forest. The State of this location is the Illinois. State, the County is the Saline. County, the location details are described as [Editor note: Directions were removed, but the location is in the. and, the nearest town is Herod. and the nearest road is Hwy 34."
    },
    {
        "description": "The headline of the report is Strange occurrences at a rural cabin near West Union causes owner to put it up for sale. The State of this location is the Ohio. State, the County is the Adams. County, the location details are described as Our cabin is near West Union in the woods and cant be seen from road. (Specific location details omitted due to ongoing investigation.). and, the nearest town is West Union. and the nearest road is OH-247."
    },
    {
        "description": "The headline of the report is Youth has daylight sighting in corn field near Rock Falls. The State of this location is the Illinois. State, the County is the Whiteside. County, the location details are described as First lot on the rightside of Woodside Dr. directly behind house about 60 yards.. and, the nearest town is Rock Falls. and the nearest road is Thome Road."
    },
    {
        "description": "The headline of the report is Man recalls seeing a large creature walk across his yard near Tioga. The State of this location is the Louisiana. State, the County is the Rapides. County, the location details are described as The location is less than 1 mile from Kissatchie National Forest.. and, the nearest town is Tioga. and the nearest road is hwy 71."
    },
    {
        "description": "The headline of the report is Possible late night sighting by camper near the UT/WY border. The State of this location is the Utah. State, the County is the Summit. County, the location details are described as Head south on highway 150 from evanston.  about 2 miles .75-1.25 miles south of the ranger station turn left on the christmas meadows road.  about half a mile turn right and then another immediate right and travel about .25-.5 miles to where we were at.. and, the nearest town is Evanston, Wyoming. and the nearest road is Highway 150."
    },
    {
        "description": "The headline of the report is Fish stolen from a boat, possible knocks and vocalizations near Punta Gorda. The State of this location is the Florida. State, the County is the Charlotte. County, the location details are described as (specific directions omitted). and, the nearest town is Punta Gorda. and the nearest road is Omitted."
    },
    {
        "description": "The headline of the report is Truck driver has daylight sighting on country road near Marys Home. The State of this location is the Missouri. State, the County is the Miller. County, the location details are described as About 200 to 400 yds.south of Buster Rd. on Hwy 17 in the middle of the highway.. and, the nearest town is Marys Home. and the nearest road is On Highway 17."
    },
    {
        "description": "The headline of the report is Boy walking near Jim Creek in afternoon hears unknown vocalizations. . The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Hwy.530, Turn R. 3 miles E. of Arlington.. and, the nearest town is Arlington. and the nearest road is Hwy 530."
    },
    {
        "description": "The headline of the report is Classic sighting on wooded Maine road. The State of this location is the Maine. State, the County is the Oxford. County, the location details are described as nan. and, the nearest town is Wilsons Mills, Maine. and the nearest road is Rt 16."
    },
    {
        "description": "The headline of the report is Memory told of seeing two sasquatches by a river west of Union. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as nan. and, the nearest town is Union. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Cabin builder sees upright figure, finds oily hand prints, hears possible knocks west of Newport. The State of this location is the Washington. State, the County is the Stevens. County, the location details are described as Four miles north of Springdale-Hunters road on county road (Lessig). On private property about a quarter of a mile from Lessig road. There is a marsh area next to the county road at the bottom of the private property. A dirt access road to the property meets the county road across from the marsh.. and, the nearest town is Hunters, WA. and the nearest road is Lessig road, a gravel county road."
    },
    {
        "description": "The headline of the report is Man tells of a possible nighttime encounter while burning garbage near Long Prairie. The State of this location is the Minnesota. State, the County is the Todd. County, the location details are described as nan. and, the nearest town is Long Prairie. and the nearest road is US highway 71."
    },
    {
        "description": "The headline of the report is Youth's presence startles unknown animal. The State of this location is the North Carolina. State, the County is the Onslow. County, the location details are described as On the military reservation Camp Lejuene marine corps base approximately 5 miles from Highway 24 in Hubert, North Carolina.. and, the nearest town is Hubert. and the nearest road is Highway 24."
    },
    {
        "description": "The headline of the report is Four teens camping hear grunting or snorting, observe creature walk from corn field into the woods. The State of this location is the Ohio. State, the County is the Miami. County, the location details are described as State Route 202 heading south to Ross road then to Wildcat Road.. and, the nearest town is Tipp City. and the nearest road is Wildcat Road."
    },
    {
        "description": "The headline of the report is Evening encounter by backpacker in Hoosier National Forest. The State of this location is the Indiana. State, the County is the Brown. County, the location details are described as Near Bedford south of Brown County in the Hoosier National Forest.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man has close encounter near Oregon border. The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as [Edited]. and, the nearest town is Medford, OR. and the nearest road is Upper Applegate Rd."
    },
    {
        "description": "The headline of the report is Family camping at Shawnee State Forest has possible encounter. The State of this location is the Ohio. State, the County is the Scioto. County, the location details are described as campsite xxx at the campgrounds of Shawnee National Forrest Park. and, the nearest town is Portsmouth. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Night time sighting of large bipedal animal by motorist near Babbitt, Minnesota. The State of this location is the Minnesota. State, the County is the St. Louis. County, the location details are described as I would have to show you. and, the nearest town is Embarrass, Ely, Aurora. and the nearest road is Hwy#21,Hwy#1 Hwy135."
    },
    {
        "description": "The headline of the report is Residents hear possible activity near Linden. The State of this location is the Virginia. State, the County is the Warren. County, the location details are described as nan. and, the nearest town is Linden. and the nearest road is Red Bud Lane."
    },
    {
        "description": "The headline of the report is Vocalizations recorded and possible footprint found near Sugar Creek. The State of this location is the Illinois. State, the County is the Sangamon. County, the location details are described as The Sugar Creek Covered Bridge area is about a mile northwest of Glenarm.. and, the nearest town is Chatham. and the nearest road is Covered Bridge Road."
    },
    {
        "description": "The headline of the report is Hiker finds possible footprints in Timber Ridge Forest Preserve (w/photos). The State of this location is the Illinois. State, the County is the Du Page. County, the location details are described as It's a brand new hiking path in the Timber Ridge Forest Preserve on the east side of Prince Crossing Road and not very well known or used yet.. and, the nearest town is Winfield. and the nearest road is Prince Crossing Road."
    },
    {
        "description": "The headline of the report is Possible camp stalking at Glade Run Pond, Monon. Nat. Forest. The State of this location is the West Virginia. State, the County is the Webster. County, the location details are described as located in the Monongahela National Forest above the Cranberry River and near the Cranberry Back country and Wilderness Area.. and, the nearest town is Richwood. and the nearest road is gated forest service road."
    },
    {
        "description": "The headline of the report is Possible nighttime sightings by three family members on a farm near New Lebanon . The State of this location is the Ohio. State, the County is the Montgomery. County, the location details are described as Just South of the New Lebanon city limits.. and, the nearest town is New Lebanon. and the nearest road is S. Clayton Road."
    },
    {
        "description": "The headline of the report is Man finds large, human-like footprints in mud while jogging near his home (photos included). The State of this location is the Arizona. State, the County is the Navajo. County, the location details are described as Following BIA 12 up past the high school football field pavement comes to an end, about 50 yards from the pavement there is a small rarely traveled road off to the right. Near the \"mouth\" of that road is where I found the \"tracks.\". and, the nearest town is Cibecue, AZ. and the nearest road is BIA 12 (I think)."
    },
    {
        "description": "The headline of the report is Witness hears late night screams near Yreka. The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as The property is about 3/4 of a mile to 1 mile west of town proper. just on the city limit line.. and, the nearest town is Yreka. and the nearest road is Greenhorn Rd.."
    },
    {
        "description": "The headline of the report is Family experiences possible activity outside their home near Bemidji. The State of this location is the Minnesota. State, the County is the Beltrami. County, the location details are described as Our house is surrounded by trees. We have 8.5 acres which borders state land that goes for miles.. and, the nearest town is BEMIDJI. and the nearest road is Removed for privacy of witness.."
    },
    {
        "description": "The headline of the report is Hunter has daylight encounter near Gills Creek. The State of this location is the Virginia. State, the County is the Franklin. County, the location details are described as nan. and, the nearest town is wirtz. and the nearest road is rt.122."
    },
    {
        "description": "The headline of the report is Hunter scouting for elk hears stick breaks & a loud scream-howl close to his tent near Randle. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as Strawberry mountain, about in the middle of the main ridge. (just NE of MT. ST. Helens). and, the nearest town is Randle. and the nearest road is FR 25."
    },
    {
        "description": "The headline of the report is Nighttime sighting by golf course worker at Arrowhead Golfcourse, aside Roxborough State Park, Rampart Range. The State of this location is the Colorado. State, the County is the Douglas. County, the location details are described as Rampart Range Road to Arrowhead Golfcourse in Roxborough Park. Hole 13 Pro Tee Box.. and, the nearest town is Littleton/Roxborough Park. and the nearest road is Rampart Range Road."
    },
    {
        "description": "The headline of the report is Hiker encounters huge, upright animal at creek on Grass Mountain. The State of this location is the Washington. State, the County is the King. County, the location details are described as Grass Mtn. Apparently Near Cyclone Creek.. and, the nearest town is Enumclaw. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is For two nights campers are scared by loud vocalizations near Brinnon. The State of this location is the Washington. State, the County is the Jefferson. County, the location details are described as At the end of the road on the Madrona Ridge road off the Mt Jupiter road. and, the nearest town is Brinnon WA. and the nearest road is Highway 101."
    },
    {
        "description": "The headline of the report is Man has brief encounter near lake. The State of this location is the Florida. State, the County is the Hernando. County, the location details are described as I lived just north of Spring Hill on Sunshine Grove Rd by Hexim Rd. near your other report approximately 3 miles. What I saw was seen by 4 or 5 people over  20 to 30 years. By Whitehurst Lake about 2 miles from US 19. I saw a man-like thing approx 7 foot tall. Its arms were longer than a man. Its head was small. It walked labored, swinging its arms. It had no real shape to it that I could tell. Just big. It stopped on the lime rock road for 1 or 2 seconds, then walked toward the lake. I ran the other way. When I told my mother she said that they had seen them for years in the 70's.. and, the nearest town is Spring Hill / Brooksville. and the nearest road is US 19 /SR 50."
    },
    {
        "description": "The headline of the report is Dusk sighting by two women near Three Lakes (w/sketch by artist). The State of this location is the Michigan. State, the County is the Baraga. County, the location details are described as nan. and, the nearest town is Between Three Lakes & Tioga. and the nearest road is Hwy 41."
    },
    {
        "description": "The headline of the report is Rockhound startled to find he's being observed. The State of this location is the Colorado. State, the County is the Douglas. County, the location details are described as Starting in Colorado Springs, go west on I-24 to Woodland Park. Turn right at the light before the McDonalds, go to the Pikes Peak National Forest and continue north on Rampart Range Road until you intersect Forest Road 348. Turn left down FR 348 (Long Hollow) for about a mile untill the road turns white with quartz (use the right off-shoot road) to get to the quartz mound, drive up the right side to the top of the mound park. The top of the mound is like a circle about 60 feet in diameter. The figure was opposite the road entrance about 20 feet into the tree line.. and, the nearest town is Woodland Park. and the nearest road is Rampart Range Road."
    },
    {
        "description": "The headline of the report is Road grader operator observes creature crossing logging road in Ocala National Forest. The State of this location is the Florida. State, the County is the Marion. County, the location details are described as nan. and, the nearest town is Salt Springs, FL. and the nearest road is state hwy. 19."
    },
    {
        "description": "The headline of the report is Family finds and hears compelling evidence near Leadville. The State of this location is the Colorado. State, the County is the Park. County, the location details are described as nan. and, the nearest town is Leadville. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Brazos River campers encounter powerful vocalizations at close range. The State of this location is the Texas. State, the County is the Palo Pinto. County, the location details are described as Location was roughly 2.0 miles south of Tx Hwy 16 south of Possum Kingdom Lake.. and, the nearest town is Brad Tx. and the nearest road is Hwy 16."
    },
    {
        "description": "The headline of the report is Young boy awakened by a loud roaring scream (Part 2). The State of this location is the Washington. State, the County is the Thurston. County, the location details are described as In an area... called The Bald Hills, near The Deschutes Falls Park. This area is between the Southwest corner of Mt. Rainier park and the town of Yelm.. and, the nearest town is Yelm. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Screams wake campers on consecutive nights at Cle Elum Lake. The State of this location is the Washington. State, the County is the Kittitas. County, the location details are described as from Cle Elum, drive ten miles northwest on highway 903, then turn west on forest service road 112. and, the nearest town is Cle Elum. and the nearest road is highway 903."
    },
    {
        "description": "The headline of the report is Man hears strange calls while hiking near swamp at Wallace Falls State Park. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Wallace Falls State Park.  Approximately 3 miles northeast of Highway 2.. and, the nearest town is Gold Bar. and the nearest road is Highway 2."
    },
    {
        "description": "The headline of the report is Nighttime sighting by trucker near Honobia. The State of this location is the Oklahoma. State, the County is the Le Flore. County, the location details are described as nan. and, the nearest town is Honobia. and the nearest road is Hwy 144."
    },
    {
        "description": "The headline of the report is Daytime road crossing seen by a retired police officer near Pembine. The State of this location is the Wisconsin. State, the County is the Marinette. County, the location details are described as The area of the road crossing was approximately 1/2 mile East of intersection of 00/0.. and, the nearest town is Pembine, WI. and the nearest road is CTY.00."
    },
    {
        "description": "The headline of the report is Possible vocalizations heard by backcountry hikers in Redwoods National Park. The State of this location is the California. State, the County is the Humboldt. County, the location details are described as [Editors' Note: Location details removed.  We know this particular area well, but this report submission pre-dates any of our own experiences there. ]. and, the nearest town is Between Eureka and Crecent city, Oregon. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Two men training a hunting dog hear a loud, deep scream then briefly witness a large hairy thing cross a small clearing. The State of this location is the Ohio. State, the County is the Erie. County, the location details are described as State Route 269 in the Resthaven Wildlife Reserve.. and, the nearest town is Castalia. and the nearest road is Route 269."
    },
    {
        "description": "The headline of the report is Separate Iowa incidents over time in Floyd County area. The State of this location is the Iowa. State, the County is the Floyd. County, the location details are described as 2 sightings at Idlewild Park in Floyd County is the first sighting, happened within 100 -200 yards from East Idlewild Park campgrounds. The thrid sighting was at West Idlewild Park which is about 2 miles upstream. The second sighting was in Clarksville IA in 77 of footprints.at the Knocksville Sand and Gravel Pits .These areas are well wooded and hard to get around in.  Very few, if any, other people go to any of these places. and, the nearest town is Floyd. and the nearest road is Gravel road."
    },
    {
        "description": "The headline of the report is Motorist sighting of a sasquatch LAST NIGHT 25 miles northwest of Milwaukee. The State of this location is the Wisconsin. State, the County is the Washington. County, the location details are described as About 1.5 miles west of hwy 164 on Pleasant Hill Rd.. and, the nearest town is Richfield. and the nearest road is This took place on Pleasant Hill Rd."
    },
    {
        "description": "The headline of the report is Mother and son have a possible early morning sighting near Eagle Creek. The State of this location is the Kentucky. State, the County is the Carroll. County, the location details are described as nan. and, the nearest town is Sanders (Carrollton). and the nearest road is Sighting on HWY 36."
    },
    {
        "description": "The headline of the report is Daytime sighting by two arrowhead hunters near Gulfport. The State of this location is the Illinois. State, the County is the Henderson. County, the location details are described as I've been back over there several times and can't find it. But my friend said she was over there recently and want's to take me back there.. and, the nearest town is Gulfport. and the nearest road is US 61."
    },
    {
        "description": "The headline of the report is Footprints, sometimes in pairs, seen periodically on family property. The State of this location is the Michigan. State, the County is the Jackson. County, the location details are described as Footprints (two pair) were moving from the north out of the swamps to the south following at least four deer moving during the early morning hours. No hair or feces were found just footprints ball of heels were ten inches and the other was smaller about eight inches the foot prints were not totally depressed into the hard dirt. Just the outlind on the footprint and the other part was obscurred by vegetation.. and, the nearest town is Horton Michigan. and the nearest road is Moscow rd."
    },
    {
        "description": "The headline of the report is Foot steps heard in wood line. Weeks later more sounds heard. The State of this location is the Florida. State, the County is the Seminole. County, the location details are described as take Winter Park dr. to the entrance of South Seminole middle school. Once enering stay to the right of the school. Pull into the sand parking lot and head down the dirt road that runs away from the school. At the fence of the school you will see three or four wooden post sticking up out of the ground, go past these post about fifty or sixty feet till you come to the fence at the rear of the school. here the first houses lot begins. Turn around look into the woods, and maybe you will see what we saw that night.. and, the nearest town is Casselberry. and the nearest road is Between Elm dr. and Winter Park dr.."
    },
    {
        "description": "The headline of the report is Two men remember hearing bone-chilling scream while parking at lookout point in Stone State Park. The State of this location is the Iowa. State, the County is the Woodbury. County, the location details are described as Look out point in Stone Park.. and, the nearest town is Sioux City, Iowa. and the nearest road is Hwy 12."
    },
    {
        "description": "The headline of the report is Man remembers a late night \"camp-circling\" along with several other young Marines outside of Albany. The State of this location is the Georgia. State, the County is the Dougherty. County, the location details are described as Unknown, but I think it was to the North-East of town.. and, the nearest town is Albany Ga.. and the nearest road is unknown."
    },
    {
        "description": "The headline of the report is Creature seen at a flooded rock quarry near Hampton. The State of this location is the Illinois. State, the County is the Rock Island. County, the location details are described as the location is now conduminiums and a marina just off route 84 at the north end of Hampton Il.. and, the nearest town is it was in Hampton Ill.. and the nearest road is 1st ave north end of town."
    },
    {
        "description": "The headline of the report is Man recalls observing possible tracks and being screamed at on his paper route in Eldridge. The State of this location is the Iowa. State, the County is the Scott. County, the location details are described as Eldridge Iowa is 10 miles north of Davenport,Iowa.. and, the nearest town is In the city of Eldridge. and the nearest road is corner of 5th st and Donahue Ave."
    },
    {
        "description": "The headline of the report is Two friends have a possible nighttime sighting on a rural road outside Madison. The State of this location is the Alabama. State, the County is the Clarke. County, the location details are described as the location is between the oil well road and the country store. and, the nearest town is Carlton. and the nearest road is county rd 15."
    },
    {
        "description": "The headline of the report is Young squirrel hunter has evening sighting on family property near Birds Run. The State of this location is the Ohio. State, the County is the Guernsey. County, the location details are described as Guernsey County, Ohio near a community called Birds Run.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Sasquatch snow tracks found at first seasonal entry onto Weyerhaeuser land near Vanson Lake. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as It was by Vanson Lake in Washington. and, the nearest town is Mt St Helens. and the nearest road is Middle of nowhere."
    },
    {
        "description": "The headline of the report is Bowhunter encounters multiple creatures chasing deer. The State of this location is the Pennsylvania. State, the County is the Adams. County, the location details are described as Michaux State Forest near Tick Tock and Pine Ridge Lane.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Fisherman sees tall figure with orange eyeshine leaving the Menominee River near Norway. The State of this location is the Michigan. State, the County is the Menominee. County, the location details are described as On the Menominee river outside of Norway Michigan in the upper peninsula of Michigan. and, the nearest town is Norway. and the nearest road is US 2."
    },
    {
        "description": "The headline of the report is Creature observed turning it's head and looking straight at witness. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as Harstine Isl. several miles N.E. of Shelton, off Hwy. 3. and, the nearest town is Shelton. and the nearest road is Hwy 3."
    },
    {
        "description": "The headline of the report is Possible tree push over and vocalization near Belchertown and Quabbin Reservoir. The State of this location is the Massachusetts. State, the County is the Hampshire. County, the location details are described as Take Route 9 through Belchertown and enter Federal street via either entrance as it is a road that turns off Rt 9, runs for about 3-4 miles then ends again at another intersection of Rt 9. It was around the street address if 722 Federal street.. and, the nearest town is Belchertown. and the nearest road is Federal Street."
    },
    {
        "description": "The headline of the report is Camping group has night time sighting near the Dosewallips River. The State of this location is the Washington. State, the County is the Jefferson. County, the location details are described as Headwatters of Dosewallips River, Royal Basin near the largest lake and rock overhang in the medow.. and, the nearest town is Brinnon WA. and the nearest road is Road off Highway 101."
    },
    {
        "description": "The headline of the report is 8' tall bigfoot crosses a road in one bound. The State of this location is the Michigan. State, the County is the Montmorency. County, the location details are described as on county road 489 heading south, the first road after the rustic inn on the right, a  road called Town Hall rd. then take that till you you come to the first road on the left called granger, keep going till you you get to a spot on the road that the whole left side is boardered by forest. and, the nearest town is Lewiston. and the nearest road is county road 489."
    },
    {
        "description": "The headline of the report is Man recounts watching a sasquatch cross road near Cross Anchor. The State of this location is the South Carolina. State, the County is the Laurens. County, the location details are described as nan. and, the nearest town is Cross anchor. and the nearest road is Hwy. 72."
    },
    {
        "description": "The headline of the report is Memory told of a possible sighting of two juveniles tree climbing at sundown near Farmville. The State of this location is the Virginia. State, the County is the Amelia. County, the location details are described as I would have to ask, a friend who hunted with my husband sometimes on directions, husband Andrew passed away 5 yrs ago. Just remember going by Appomattox surrender grounds, and taking a left before entering farmville, va. and, the nearest town is Farmville,va. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Sightings by two hunters in tree stands outside Elkwater. The State of this location is the West Virginia. State, the County is the Randolph. County, the location details are described as Southern Randolph County. and, the nearest town is Elkwater. and the nearest road is (Edited)."
    },
    {
        "description": "The headline of the report is Man has sighting after massive landslide on Highway 50. The State of this location is the California. State, the County is the El Dorado. County, the location details are described as nan. and, the nearest town is Meyers. and the nearest road is Highway 50."
    },
    {
        "description": "The headline of the report is Son and friend find footprints. Later something stalks them along riverbank, incident retold by his father. The State of this location is the Kansas. State, the County is the Neosho. County, the location details are described as The location is a tributary creek that flows into Lake Parsons, and can be accessed by turning south of Galesburg, KS for two miles, then back west about one half mile to the creek bridge.. and, the nearest town is Galesburg, Kansas. and the nearest road is U.S. 59."
    },
    {
        "description": "The headline of the report is Resident on Nooksack River reports possible ongoing Class B Incidents. The State of this location is the Washington. State, the County is the Whatcom. County, the location details are described as Nooksack river area east of Deming WA. and, the nearest town is Deming. and the nearest road is Mt. Baker Hwy."
    },
    {
        "description": "The headline of the report is Possible daylight sighting by a homeowner from her window near Marengo. The State of this location is the Ohio. State, the County is the Morrow. County, the location details are described as Close to houses. and, the nearest town is Marengo. and the nearest road is County Rd 206."
    },
    {
        "description": "The headline of the report is Still hairy figure seen in a field by a motorist near Springfield. The State of this location is the Oregon. State, the County is the Lane. County, the location details are described as Field next to the new business park.. and, the nearest town is Springfield. and the nearest road is High Banks Rd."
    },
    {
        "description": "The headline of the report is Man hunting deer finds unusual feces and hears animal. The State of this location is the Washington. State, the County is the Chelan. County, the location details are described as North on Hwy 97 Alt to the Entiat turn off, NW on this road for about 30 miles, past the small gas station, post office, cafe and church with the sign of Ardenvoir on it. Just about half way up the 5900 road to Shady Pass is the turn off for the 5901 road. Silver creek intersects this road mid way to a junction with the 5902 road.. and, the nearest town is Ardenvoir. and the nearest road is Non-maintained forest service road and then next nearest major road would be Entiat river Road.."
    },
    {
        "description": "The headline of the report is A man gathering firewood for his campsite with his ATV encounters a large ape-like animal in a creek bed. The State of this location is the Missouri. State, the County is the Pike. County, the location details are described as On our family farm in Cyrene, MO. Pike County.. and, the nearest town is Cyrene. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Motorist has nighttime sighting and strange incidents near Lake Weohyakapka. The State of this location is the Florida. State, the County is the Polk. County, the location details are described as Boat landing Rd. and walk-in-the-water Rd.,east of Lake Wales.  I would not like to list the exact location as I do not want people out to harm or harass the creature.. and, the nearest town is Nalcrest. and the nearest road is Hwy 60."
    },
    {
        "description": "The headline of the report is Motorists have early morning sighting near Enterprise. The State of this location is the Mississippi. State, the County is the Clarke. County, the location details are described as The location of this incident was on Interstate 59 between Enterprise and Meridian. and, the nearest town is Enterprise/Meridian. and the nearest road is Interstate 59."
    },
    {
        "description": "The headline of the report is Two people spot a 7-8 foot tall creature walking on two legs. . The State of this location is the Michigan. State, the County is the Monroe. County, the location details are described as This occurred on Newburg Road east of Rawsonville Road in Monroe County, Michigan.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man has encounter at close range for several minutes. The State of this location is the Texas. State, the County is the Jack. County, the location details are described as East of Bryson, Texas on a dirt road.. and, the nearest town is Bryson. and the nearest road is State Highway 380."
    },
    {
        "description": "The headline of the report is Creature observed running across the road. . The State of this location is the Oklahoma. State, the County is the Caddo. County, the location details are described as nan. and, the nearest town is Stecker (near Apache). and the nearest road is Dirt road near Highway 281."
    },
    {
        "description": "The headline of the report is Military serviceman finds 15 inch tracks in People's State Forest CT. The State of this location is the Connecticut. State, the County is the Litchfield. County, the location details are described as People State Forest access road off of the Farmington River.. and, the nearest town is Barkhamsted. and the nearest road is Route 44."
    },
    {
        "description": "The headline of the report is Two hunters hear repeated loud screams. . The State of this location is the Oregon. State, the County is the Columbia. County, the location details are described as Vernonia Rd. to Clear Crk. Rd. to Columbia River Mainline. North to Rocky Pt. Rd. and West approx. 3/4 mile.. and, the nearest town is Four Corners/ Hwy 26. and the nearest road is Clear Crk. Rd.."
    },
    {
        "description": "The headline of the report is Campers have strange encounter near swamp in the Upper Peninsula. The State of this location is the Michigan. State, the County is the Delta. County, the location details are described as To get to the location you would turn off of US2 at the top of Whitefish hill and drivedown 511 past 509 to what is now the parking lot at the head of the Rapid River Snowmobile trail. There take the road heading north into the woods. You will come to a split after just a minute. Take the one to the right. You will come to a forest service gate that will probably be closed. If it is, you can continue on foot up the road about 1/2 mile to the site. If it is open you can drive up. Be careful is you don't have a 4x4 or good clearance. There has been some significant logging in the area so the way in is much different than it was at the time but the actually site is pretty much unchanged. If you have read the description above, you will know it when you get to the right spot.. and, the nearest town is Rapid River. and the nearest road is Road=County Road 511 HWY=US2."
    },
    {
        "description": "The headline of the report is Hunters have several encounters near Ash Cave State Park. The State of this location is the Ohio. State, the County is the Hocking. County, the location details are described as Near Ash Caves State Park. and, the nearest town is Goes. and the nearest road is SR 56."
    },
    {
        "description": "The headline of the report is Witness spots sasquatch approaching camp near Warwoman Dell. The State of this location is the Georgia. State, the County is the Rabun. County, the location details are described as You can find it. Its a state run campsite.. and, the nearest town is Clayton. and the nearest road is Warwoman Rd."
    },
    {
        "description": "The headline of the report is Youth has nighttime sighting along Rock River. The State of this location is the Illinois. State, the County is the Whiteside. County, the location details are described as About four and a half miles outside of Erie following River Road next to Johnson Slough.. and, the nearest town is Erie. and the nearest road is Sand Road."
    },
    {
        "description": "The headline of the report is Sisters witness a large, dark biped running through the back of their property near Chardon. The State of this location is the Ohio. State, the County is the Geauga. County, the location details are described as Specific directions omitted for privacy.. and, the nearest town is Chardon. and the nearest road is US Route 6."
    },
    {
        "description": "The headline of the report is 5 children observe a very large hairy \"man\" for several minutes (N. Ft. Myers). The State of this location is the Florida. State, the County is the Lee. County, the location details are described as The name of the trailer court was Twin Lakes Estates. It was just off US Hwy. 41 and there was a place called \"The Shell Factory\" a tourist attraction nearby.. and, the nearest town is Fort Myers, Florida. and the nearest road is US Hwy. 41."
    },
    {
        "description": "The headline of the report is Cave explorers recall bizarre experiences while camping in the Seneca Creek Backcountry. The State of this location is the West Virginia. State, the County is the Pendleton. County, the location details are described as nan. and, the nearest town is Seneca Rocks, 7 miles as crow flies. and the nearest road is Rte. 33/55 from Seneca Rocks to Harman."
    },
    {
        "description": "The headline of the report is LEO recalls his daylight sighting as a youth with his horses NW of Atlanta. The State of this location is the Georgia. State, the County is the Paulding. County, the location details are described as Off of Hwy 61 in Dallas Georgia in Paulding County. In Burnt Hickory Estates Stephen Court. Behind my house in the 125 acre woods behind my pasture that was 4 acres. Standing to the left of my barn.. and, the nearest town is Dallas Georgia. and the nearest road is Hwy 61."
    },
    {
        "description": "The headline of the report is Afternoon road-crossing sighting by motorist on RT 61 near Concho. The State of this location is the Arizona. State, the County is the Apache. County, the location details are described as Coming down off a slight rise.  The sides of the road were low, you would have to climb up onto the highway.  There were lots of junipers about 10 to 15 tall on both sides of the road.  I failed to get a road marker.  It happened so fast and I was so unprepared.. and, the nearest town is About 6 miles from Concho, AZ. and the nearest road is The main highway between Sow Low and Concho."
    },
    {
        "description": "The headline of the report is 16-year-old girl has nighttime sighting near hot springs. The State of this location is the Idaho. State, the County is the Valley. County, the location details are described as nan. and, the nearest town is Cascade. and the nearest road is Highway 55."
    },
    {
        "description": "The headline of the report is Hunter near Raymond hears what sounds like a sasquatch chasing and killing a deer. The State of this location is the Washington. State, the County is the Grays Harbor. County, the location details are described as 101 so, logging road m-line to m-2800 #4. and, the nearest town is aberdeen -- raymond. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Nightime roadside sighting south of Woolaroc . The State of this location is the Oklahoma. State, the County is the Osage. County, the location details are described as about 1 mile south of wooloroc on highway 123. and, the nearest town is Barnsdall, Oklahoma. and the nearest road is Highway 123."
    },
    {
        "description": "The headline of the report is Hiker has daytime sighting in Colville National Forest. The State of this location is the Washington. State, the County is the Pend Oreille. County, the location details are described as it was in Colville National Forest I do not have exact coordinates as we were off trail.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Vocal communications heard between two separate animals. . The State of this location is the California. State, the County is the Del Norte. County, the location details are described as Northern California, Del Norte County, 15 miles north east of Gasquet Ca. off highway 199, up Little Jones Creek Road about 4 miles.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Couple sees a white sasquatch at Settle's Ford Conservation Area. The State of this location is the Missouri. State, the County is the Cass. County, the location details are described as Cass county side of Settles Ford on the north side of the river, 2nd parking lot coming into the conservation area before reaching the river. and, the nearest town is Grandview. and the nearest road is US 71."
    },
    {
        "description": "The headline of the report is Daylight sighting by rancher on Mt. Graham. The State of this location is the Arizona. State, the County is the Graham. County, the location details are described as Southwest foothills of Pinaleno Mts--locally known as Mt Graham--nearest town being Fort Grant Military Prison. Graham County, Arizona. Nearest road is AZ Rte 266, 35 plus miles from US I-10.. and, the nearest town is Fort Grant Military Prison. and the nearest road is AZ Rte 266, 35 plus miles from US I-10."
    },
    {
        "description": "The headline of the report is Possible trash snatching (2 witnesses) outside Sherando. The State of this location is the Virginia. State, the County is the Augusta. County, the location details are described as Go south on 664 from Sherando. Turn west on FR42 and go 1-2 miles. You come to a small bridge where creek crosses road. There is a pull off on right side of road. The forest service has bulldozed the area in later years and site does not look the same.. and, the nearest town is Sherando. and the nearest road is FR42."
    },
    {
        "description": "The headline of the report is Hunters Hear High Country Vocalizations. The State of this location is the Colorado. State, the County is the Moffat. County, the location details are described as East side of Douglas Mountain and West side of the Little Snake River.. and, the nearest town is Greystone. and the nearest road is Hwy 318."
    },
    {
        "description": "The headline of the report is Mussel poachers have night time encounter near Lake Barkley. The State of this location is the Kentucky. State, the County is the Trigg. County, the location details are described as nan. and, the nearest town is GRAND RIVERS. and the nearest road is THE TRACE HWY."
    },
    {
        "description": "The headline of the report is Trucker's daylight sighting of a Sasquatch in Francis Marion National Forest. The State of this location is the South Carolina. State, the County is the Berkeley. County, the location details are described as The route I took that time was through the back country due to google maps trying to give the most economical route. To the best of my memory it was near Hwy 41 and Steed Creek Road.. and, the nearest town is Huger. and the nearest road is Hwy 41."
    },
    {
        "description": "The headline of the report is Two young men are confronted in broad daylight by a large creature near Falcon. The State of this location is the North Carolina. State, the County is the Sampson. County, the location details are described as [Omitted at witness' request]. and, the nearest town is Falcon. and the nearest road is SR 1005."
    },
    {
        "description": "The headline of the report is Tracks found in deep snow. The State of this location is the Washington. State, the County is the Spokane. County, the location details are described as East side of Mount Spokane above the timber line (NE of Spokane Washington). and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Eight foot tall creature seen standing under a tree at family cabin. The State of this location is the Michigan. State, the County is the Dickinson. County, the location details are described as Near the town of Hardwood, Dickenson County, Michigan, off an old logging road that ran off Rt. 69 west of Escanaba, Michigan.. and, the nearest town is Hardwood. and the nearest road is Rt. 69."
    },
    {
        "description": "The headline of the report is Daytime sighting by a wildlife biologist on a trail in the Cypress Creek Preserve. The State of this location is the Florida. State, the County is the Hillsborough. County, the location details are described as Cypress Creek nature preserve between interstates 275 and 75 near the apex where they meet.  The sighting was about a mile due west of Freedom High School.. and, the nearest town is New Tampa. and the nearest road is Interstate 75."
    },
    {
        "description": "The headline of the report is Fisherman don't return to their hot spot after strange encounter one night near Aberdeen. The State of this location is the Ohio. State, the County is the Brown. County, the location details are described as Hot water discharge for the DP&L power plant. Located between Aberdeen and Manchester on State route 52.. and, the nearest town is Aberdeen/ Manchester. and the nearest road is US State Route 52."
    },
    {
        "description": "The headline of the report is Camper startles a \"Chewbacca\" like creature in Palo Duro Canyon State Park. The State of this location is the Texas. State, the County is the Randall. County, the location details are described as nan. and, the nearest town is Canyon. and the nearest road is In Palo Duro Canyon State Park."
    },
    {
        "description": "The headline of the report is Public service officer hears unidentifiable screams and grunts near Hiram. The State of this location is the Georgia. State, the County is the Paulding. County, the location details are described as .. and, the nearest town is HIRAM. and the nearest road is BAKERS BRIDGE."
    },
    {
        "description": "The headline of the report is Train engineer reports track find and vocalizations on Stevens Pass. The State of this location is the Washington. State, the County is the Chelan. County, the location details are described as I will not give directions   No tresspassing on railroad property.  I don't want problems with my job.. and, the nearest town is Winton. and the nearest road is hwy 2."
    },
    {
        "description": "The headline of the report is Unusual tracks found. . The State of this location is the Washington. State, the County is the Columbia. County, the location details are described as From the town of Dayton in the Blue Mts. Up skyline dr to Maloney Mtn. road, down maloney about 2mi there is a clearcut there on the right. the tracks crossed the main road and walked the edge of the clearcut fire break to the timber, where i lost them in the toucanon wilderness.. and, the nearest town is Dayton. and the nearest road is Maloney Mtn. Rd."
    },
    {
        "description": "The headline of the report is Daylight sighting by two hikers at trailhead for Hideout Hollow in Buffalo National River. The State of this location is the Arkansas. State, the County is the Newton. County, the location details are described as Hideout Hollow Trailhead. and, the nearest town is Compton. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Female fly fisherman's lucid recollection of classic territorial intimidation behavior of Saquatches ; 6mi NE of Mystic Lake. The State of this location is the Montana. State, the County is the Stillwater. County, the location details are described as To get there take Highway 78 south out of Absarokee about 2.5 miles and turn right (west) onto the road to Fishtail. Go past Fishtail about a mile and turn left (east) onto West Rosebud Road. Four miles farther, turn right (west) at the sign to Mystic Lake. Just 2.6 miles farther down the road, turn left (south) when the road Ys and take the gravel road across the West Rosebud River. The road parallels the river south before crossing it again. From this bridge, go 2 miles and across a cattle guard. Park just on the other side of the cattle guard. This is near the BLM corner.. and, the nearest town is Fishtail, Montana. and the nearest road is Highway 78."
    },
    {
        "description": "The headline of the report is Boy wakes and has sighting through bedroom window in Shelton. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as its the house across from my brothers house, whish is(edited) drive, or (edited) drive, however the house has been sold since then, but I would be glad to show you where it is. and, the nearest town is shelton. and the nearest road is our house was at the end of a long driveway."
    },
    {
        "description": "The headline of the report is Sightings by hunting guide in Pike National Forest . The State of this location is the Colorado. State, the County is the Teller. County, the location details are described as nan. and, the nearest town is Woodland Park, CO.. and the nearest road is Hwy 67."
    },
    {
        "description": "The headline of the report is Driver has early morning encounter near Rice Hill. The State of this location is the Oregon. State, the County is the Douglas. County, the location details are described as Approximately mile post 147 on I-5.. and, the nearest town is Rice Hill, Oregon. and the nearest road is Interstate-5."
    },
    {
        "description": "The headline of the report is Children find 19\" tracks in snow. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Near White Horse Mt.. and, the nearest town is Darrington. and the nearest road is FR18."
    },
    {
        "description": "The headline of the report is Nighttime road crossing observed by a father and daughter near Quantico Marine Corp Base . The State of this location is the Virginia. State, the County is the Stafford. County, the location details are described as nan. and, the nearest town is Stafford VA. and the nearest road is Widewater Road."
    },
    {
        "description": "The headline of the report is Hiker describes possible vocalizations and rocks thrown at a remote lake in the Alpine Lakes Wilderness. The State of this location is the Washington. State, the County is the Kittitas. County, the location details are described as I-90 Exit 50 (Bullfrog) to Roslyn, north on 903 to Salmon La Sac, left on 4600, 3-4 miles up this road.. and, the nearest town is Ronald. and the nearest road is Forest Rd. 4600."
    },
    {
        "description": "The headline of the report is Nightime sighting at a Lake Milton marina. The State of this location is the Ohio. State, the County is the Mahoning. County, the location details are described as Mahoning County, Lake Milton reservoir. and, the nearest town is Diamond. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man recalls his face to face daylight encounter in Siloam Springs State Park. The State of this location is the Illinois. State, the County is the Adams. County, the location details are described as Siloam Springs State Park.. and, the nearest town is Chestline. and the nearest road is County Road 14."
    },
    {
        "description": "The headline of the report is Hog hunter encounters unknown animal near Sabine River. . The State of this location is the Texas. State, the County is the Wood. County, the location details are described as Near the Sabine River.. and, the nearest town is Alba. and the nearest road is Hwy 17."
    },
    {
        "description": "The headline of the report is Elk hunter observes an apparent family group. The State of this location is the Idaho. State, the County is the Bear Lake. County, the location details are described as Elk Valley in Bear Lake Co. east of Montpelier, Idaho near Wyoming. Specifically at some beaver ponds called \"The Bloody Bucket\".. and, the nearest town is Montpelier. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Late evening sighting north of Bear Valley. The State of this location is the Utah. State, the County is the Millard. County, the location details are described as This was north of Bear Valley. In. and, the nearest town is Beaver. and the nearest road is I-15."
    },
    {
        "description": "The headline of the report is Woman has sighting through dental office window. . The State of this location is the Oklahoma. State, the County is the Rogers. County, the location details are described as 1755 NORTH HIGHWAY 66, CATOOSA, OKLAHOMA. and, the nearest town is Catoosa, Oklahoma. and the nearest road is HIGHWAY 66."
    },
    {
        "description": "The headline of the report is Possible Sighting by Deer Hunter in the Ottawa National Forest. The State of this location is the Michigan. State, the County is the Iron. County, the location details are described as Ottawa National Forest between the north branch of the paint river and the borski creek.. and, the nearest town is Sidnaw. and the nearest road is county road 485."
    },
    {
        "description": "The headline of the report is Elk hunter spots reddish-brown sasquatch. The State of this location is the Oregon. State, the County is the Umatilla. County, the location details are described as north side of usfs rd 64 (skyline)about opposite jubilee lake at about 1 or two PM. I was down the skookum spring side of dusty ridge about 1/4 to 1/2 mile from dusty spring, (approx 50 76 45 n 117 59 30w). and, the nearest town is tollgate, OR. and the nearest road is usfs 64."
    },
    {
        "description": "The headline of the report is Husband,wife and nephew observe a bigfoot cross the road. The State of this location is the Arizona. State, the County is the Maricopa. County, the location details are described as At the cotton fields and the golf course on Baseline and 59 Ave,. and, the nearest town is Phoenix / Laveen. and the nearest road is Baseline Rd.."
    },
    {
        "description": "The headline of the report is Possible nighttime encounter at a home outside Turkey Run State Park. The State of this location is the Indiana. State, the County is the Parke. County, the location details are described as Directions omitted upon request.. and, the nearest town is Marshall. and the nearest road is highway 41."
    },
    {
        "description": "The headline of the report is Youths in Summer Camp have noisy nighttime experience. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as A camp now called Camp Arnold at Timberlake, belonging to the Salvation Army, about 5 miles WNW of Eatonville.. and, the nearest town is Eatonville. and the nearest road is Webster Road E.."
    },
    {
        "description": "The headline of the report is Woman & her horse have a daytime encounter, near Keystone State Park. The State of this location is the Pennsylvania. State, the County is the Westmoreland. County, the location details are described as I don't know know the names of the roads, all I can say is it was on the outskirts of Keystone State Park, Derry Pa.  This is a little back road that leads to the village of Superior, Derry Pa.. and, the nearest town is Derry Pa.. and the nearest road is I was on the road.."
    },
    {
        "description": "The headline of the report is Witnesses in van catch brief glimpse of bipedal figure walking along road near Louisa. The State of this location is the Virginia. State, the County is the Louisa. County, the location details are described as I don't live in the area anymore, but it's the only road from Louisa to Mineral VA. My friend who saw it with me, still lives in the area, and I'll try to get in touch with her.. and, the nearest town is Between Louisa and Mineral VA. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Deputy sheriff has vehicle near miss with nine foot tall biped. The State of this location is the Idaho. State, the County is the Adams. County, the location details are described as It was about 10 Miles North of Council, just after you start down Fort Hall Hill.. and, the nearest town is Council. and the nearest road is US 95."
    },
    {
        "description": "The headline of the report is Possible daylight sighting near Missouri River and Katy Trail outside Hartsburg. The State of this location is the Missouri. State, the County is the Boone. County, the location details are described as It was on the bottoms of the Missouri River South of Hartsburg Mo about 1500ft.. and, the nearest town is Harsburg. and the nearest road is South Bush Landing Road."
    },
    {
        "description": "The headline of the report is Couple finds tracks in backyard pond. The State of this location is the Tennessee. State, the County is the Henderson. County, the location details are described as we are off of highway 40. and, the nearest town is wildersville. and the nearest road is farmsville rd.."
    },
    {
        "description": "The headline of the report is Daylight sighting by hikers near Lake Fork, off the Conejos River. . The State of this location is the Colorado. State, the County is the Conejos. County, the location details are described as Conejos County, Colorado...sighted on Lake Fork of the Conejos, on the Lake Fork foottrail, about half way between Big Lake and Rock Lake...sighting was made from the eastern branch of the Saddle Creek logging road...line-of-sight distance approx 2.5 miles SSE of Platoro, Colorado I was on the logging road, about 0.25 miles lateral and 1,000ft or so vertical distance from the Lake Fork trail when I made the sighting...we were standing on a rocky overlook next to the logging road which allowed a good view of the Lake Fork Valley, including Big Lake and Rock Lake. and, the nearest town is Platoro, Colorado. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Vocalization heard at close range on Appalachian Trail (Gooch Mountain Shelter). The State of this location is the Georgia. State, the County is the Union. County, the location details are described as Gooch Mountain Shelter. and, the nearest town is Sarah. and the nearest road is Cooper Gap Rd.."
    },
    {
        "description": "The headline of the report is Hunter scouting locations has a possible encounter near Buhl. The State of this location is the Minnesota. State, the County is the St. Louis. County, the location details are described as Morse Rd to the west and Hwy 169 to the north, a large swamp to the west and east. I was facing north when I saw it. Ten seconds before I saw it is when I heard the howling in the swamp to the west of my position.. and, the nearest town is Buhl MN. and the nearest road is Morse Rd."
    },
    {
        "description": "The headline of the report is Grandson relates grandparents' accounts in the Wasatch-Cache National Forest. The State of this location is the Utah. State, the County is the Weber. County, the location details are described as (Precise location removed at request of report submitter). and, the nearest town is Huntsville. and the nearest road is UT-39."
    },
    {
        "description": "The headline of the report is Possible daytime sighting behind a home outside Anadarko. The State of this location is the Oklahoma. State, the County is the Caddo. County, the location details are described as Just behind our home in Prairie Village. The housing addition is just off of First Street and our home backs up to the Washita River and we live on the culdasac Tonemah Parkway.. and, the nearest town is Anadarko. and the nearest road is Tonemah Parkway."
    },
    {
        "description": "The headline of the report is Seasoned hunter hears unknown screams from his stand near Holopaw. The State of this location is the Florida. State, the County is the Osceola. County, the location details are described as wildlife area. and, the nearest town is Holopaw. and the nearest road is 192."
    },
    {
        "description": "The headline of the report is Camper hears possible vocalizations after dark near Cooper Lake. The State of this location is the Washington. State, the County is the Kittitas. County, the location details are described as Cooper Lake Washington. and, the nearest town is Roslyn. and the nearest road is NF-46."
    },
    {
        "description": "The headline of the report is Close daylight sighting of animal crossing road near Spirit Lake. The State of this location is the Idaho. State, the County is the Bonner. County, the location details are described as go ahead , use this info as you wish but not in a deflamatory way please .   I believe the being went across the in westerly direction from geographical memory but it felt like a northly direction as well - the sun was kind of in front of us as we were heading on the road and kind of to our left .. and, the nearest town is bonners ferry. and the nearest road is the road to bonner ferry from spirit Lake."
    },
    {
        "description": "The headline of the report is Teen hears possible knocks and vocalizations in woods across from his house outside Middleburg. The State of this location is the Florida. State, the County is the Clay. County, the location details are described as nan. and, the nearest town is middleburg. and the nearest road is 218."
    },
    {
        "description": "The headline of the report is Knocks heard in the Ocala National Forest . The State of this location is the Florida. State, the County is the Lake. County, the location details are described as We all expeditioners know it as the sinkhole and it is near FR 445 N.. and, the nearest town is Altoona or Astor. and the nearest road is highway 19."
    },
    {
        "description": "The headline of the report is Possible collision with vehicle outside Homestead. The State of this location is the Florida. State, the County is the Dade. County, the location details are described as US 27. and, the nearest town is Homestead. and the nearest road is US 27."
    },
    {
        "description": "The headline of the report is Young boy has night time sighting  near Chrisney. The State of this location is the Indiana. State, the County is the Spencer. County, the location details are described as As you travel south on highway 131 from Gentryville, you will hit a curve that turns east from an intersetion with a highway that comes from boonville, IN.  At a sharp curve back to the south towards Chrisney, IN, you turn off to the east and follow a one lane country road east to an T intersection with a another country road.  You will be about 1/4 mile off 131.  Then you turn left on this gravel road and head north.  You will see the old barn and farmhouse just to your right.  Today a cell tower stands on the property which makes it easy to spot and identify.. and, the nearest town is Chrisney. and the nearest road is country gravel road or Highway 131."
    },
    {
        "description": "The headline of the report is A Wildlife Biologist observes a large upright walking animal near Pinecrest. The State of this location is the California. State, the County is the Tuolumne. County, the location details are described as Upstream from Bloomer Lake.. and, the nearest town is Pinecrest. and the nearest road is Hwy 108."
    },
    {
        "description": "The headline of the report is Close-up nighttime sighting from a car near Kearney. The State of this location is the Missouri. State, the County is the Clay. County, the location details are described as Small game access point off of C Highway not far from a small church.. and, the nearest town is Kearney. and the nearest road is C Highway."
    },
    {
        "description": "The headline of the report is Elk hunters find two sets of bare-foot tracks in the snow near Palmer Junction. The State of this location is the Oregon. State, the County is the Union. County, the location details are described as This area is located in the north east corner of the state, north of Elgin. These tracks were locate on the south west slop of Lookout Mountain.. and, the nearest town is Palmer Junction. and the nearest road is Jubilee Road."
    },
    {
        "description": "The headline of the report is Elk hunter watches large and small upright animals cross beneath power lines. The State of this location is the Oregon. State, the County is the Polk. County, the location details are described as About five miles south of Hwy 22 on an old logging dirt road.  We were camping on the western most side of Polk County.. and, the nearest town is Dallas, OR. and the nearest road is Hwy 22."
    },
    {
        "description": "The headline of the report is Daylight sighting while scouting hunting locations near Skibo. The State of this location is the Minnesota. State, the County is the St. Louis. County, the location details are described as Off Town Line Road 16 by the Skibo overlook.. and, the nearest town is Skibo Minnesota. and the nearest road is Highway 110."
    },
    {
        "description": "The headline of the report is Brief predawn encounter with a smaller creature near the Obion River. The State of this location is the Tennessee. State, the County is the Dyer. County, the location details are described as near the cross on lanes ferry hwy of of 51 hwy. and, the nearest town is Dyersburg TN. and the nearest road is hwy 51."
    },
    {
        "description": "The headline of the report is Recollections of numerous encounters at a logging camp during the Great Depression . The State of this location is the Missouri. State, the County is the Buchanan. County, the location details are described as logging area. and, the nearest town is ST.Joseph. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Travelers watch tan-brown 5-6 foot hairy creature drink from stream with cupped hands. The State of this location is the Oregon. State, the County is the Umatilla. County, the location details are described as Umatilla reservation. I-84 out of Pendleton to the top of Emigrant Pass about 8 miles from the summit facing southwest into a canyon on the south side of Emigrant Springs.. and, the nearest town is Approximately half way between Pendleton an La Grande OR. and the nearest road is Old Oregon Trail -- Off Old US30."
    },
    {
        "description": "The headline of the report is Man collecting pine nuts retreats from intimidation approach, above French Gulch near Lake Shasta. The State of this location is the California. State, the County is the Shasta. County, the location details are described as From the City of Redding take the Hwy. to Whiskeytown Lake until you get to the turnoff to French Gulch on the North side heading west. Then take a right turn for the old town of French Gulch. Pass French Gulch still heading North on winding paved road. Then paved road ends to a dirt road. Keep following this road till you get to the signs saying keep out unless you have a permit to cut fire wood. Follow this road and the roads are many from their, then go North By North West several miles into the wilderness.. and, the nearest town is French Gulch. and the nearest road is French Gulch Road."
    },
    {
        "description": "The headline of the report is 1. loud vocalization sounds woke sleeping couple. 2. family dog found injured. The State of this location is the Florida. State, the County is the Volusia. County, the location details are described as nan. and, the nearest town is Edgewater. and the nearest road is US 1."
    },
    {
        "description": "The headline of the report is Woman home alone north of Greenville claims unusual nightly visitor. The State of this location is the Texas. State, the County is the Hunt. County, the location details are described as Off Hwy 69 about a mile. At my home. and, the nearest town is Greenville. and the nearest road is Hwy 69 north."
    },
    {
        "description": "The headline of the report is Deer hunter recalls possible early morning encounter near Boone Lake. The State of this location is the Tennessee. State, the County is the Sullivan. County, the location details are described as See Report. and, the nearest town is Piney Flats. and the nearest road is Highway 11E."
    },
    {
        "description": "The headline of the report is Man recalls a late night encounter while parking in a remote area north of Splendora. The State of this location is the Texas. State, the County is the Liberty. County, the location details are described as East of Highway 59 about 5 miles north of Splendora and 4 or so miles south of Cleveland. Not sure of the name of the road.. and, the nearest town is Splendora. and the nearest road is Highway 59."
    },
    {
        "description": "The headline of the report is Multiple incidents including rock throwing at a rural cabin near Kalkaska . The State of this location is the Michigan. State, the County is the Kalkaska. County, the location details are described as (Specific directions omitted for privacy reasons.) Cabin is set back off the road on the left side.. and, the nearest town is Kalkaska, MI. and the nearest road is M 66."
    },
    {
        "description": "The headline of the report is Father, son and cousin enounter a large hair covered creature while wading through a creek. The State of this location is the Ohio. State, the County is the Ross. County, the location details are described as Southeast of Clarksburg, Ohio  towards Chillicothe,. and, the nearest town is Clarksburg. and the nearest road is Browns Chapel Rd."
    },
    {
        "description": "The headline of the report is Camper reports possible knocks in daylight near Conasauga River. The State of this location is the Georgia. State, the County is the Murray. County, the location details are described as I have to dig out my old GA topo maps! They still have the lat long on them for the campsite. I just have to find them again! But will email them to you when I do find em!. and, the nearest town is Eton, Dalton Georgia. and the nearest road is 411 an 76."
    },
    {
        "description": "The headline of the report is Possible early morning sighting by a couple driving near Hedgesville. The State of this location is the West Virginia. State, the County is the Berkeley. County, the location details are described as Heading east on Swinging Bridge Rd twds Dry Run Rd.. just past Cavern Rd. and, the nearest town is Hedgesville. and the nearest road is Swinging Bridge Rd."
    },
    {
        "description": "The headline of the report is Motorist traveling near the Ohio River has bigfoot sighting outside Chesire. The State of this location is the Ohio. State, the County is the Gallia. County, the location details are described as It is about 2 miles out Little Kyger road off of Ohio state route 7 in the cheshire ohio area, over a dip in the road just past the old high school (River Valley )... and, the nearest town is Cheshire, Ohio. and the nearest road is Little Kyger Rd."
    },
    {
        "description": "The headline of the report is Teen reading on porch late at night sees large, humanlike figure. The State of this location is the Pennsylvania. State, the County is the Perry. County, the location details are described as nan. and, the nearest town is Ickesburg. and the nearest road is not known."
    },
    {
        "description": "The headline of the report is Sighting and other observations along the Niobrara River. The State of this location is the Nebraska. State, the County is the Holt. County, the location details are described as (removed at witness's request). and, the nearest town is (removed at witness's request). and the nearest road is County road which runs east of (edit) along the Niobrara River."
    },
    {
        "description": "The headline of the report is Nighttime sighting by mother and son in Lynx, near West Union. The State of this location is the Ohio. State, the County is the Adams. County, the location details are described as The nearest town that shows on a map is West Union, we actually live some 8-10 miles easterly. and, the nearest town is West Union near Lynx. and the nearest road is Tobe Lewis Road."
    },
    {
        "description": "The headline of the report is Large  humanoid figure seen at night near beach. The State of this location is the Florida. State, the County is the Volusia. County, the location details are described as It was walking down the driving area of the beach southward toward the wildlife preserve.... and, the nearest town is New Smyrna Beach. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Biped sighted crossing road at night near Lake Bemidji. The State of this location is the Minnesota. State, the County is the Beltrami. County, the location details are described as nan. and, the nearest town is Bemidji. and the nearest road is Irvine."
    },
    {
        "description": "The headline of the report is Boy has evening sighting while bike riding with brothers near Booneboro River. The State of this location is the Kentucky. State, the County is the Clark. County, the location details are described as Clark County Kentucky between Winchester and Richmond near the Booneboro River on Elkon Station Road near a railroad track.. and, the nearest town is Winchester and Richmond. and the nearest road is Elkon Station Road."
    },
    {
        "description": "The headline of the report is Hunter describes close encounter outside Doty. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as it was an area that had been closed to motorist traffic for the last 3 years. not sure of the road numbers but I could find it easy if I had to. and, the nearest town is doty. and the nearest road is 8000 line."
    },
    {
        "description": "The headline of the report is Wood Knocks and Vocalizations are heard then something hits the side of a remote cabin. The State of this location is the Idaho. State, the County is the Benewah. County, the location details are described as nan. and, the nearest town is Saint Marie’s Idaho. and the nearest road is Benewah Creek Road."
    },
    {
        "description": "The headline of the report is Possible roadside sighting in the daytime in Myakka City. The State of this location is the Florida. State, the County is the Manatee. County, the location details are described as 73rd Avenue E at Long Creek, which are the wetlands near the Myakka River.. and, the nearest town is Myakka City. and the nearest road is Wachula Road."
    },
    {
        "description": "The headline of the report is Woman hears nighttime screams near Polk. The State of this location is the Missouri. State, the County is the Polk. County, the location details are described as The area is open fields along with heavy wooded areas.  Mostly for cattle grazing.  We lived on a 200 acres farm at the time.  We lived on a gravel road about 3 miles outside of town.  It was road 157.. and, the nearest town is Humansville. and the nearest road is about a mile from 13 Hwy."
    },
    {
        "description": "The headline of the report is Couple camping at a lake near Greenwater experience possible screams. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as It is mostly deserted in the fall because of cold and is an isolated location on secluded hillside with non friendly vehicle road.very dark at night and lots of animals and fish in lake!. and, the nearest town is greenwater Wa.. and the nearest road is Off of fs70off of hwy410 (precise location edited to protect the site)."
    },
    {
        "description": "The headline of the report is Threatening bellows directed at hikers and their dogs in the Holy Cross Wilderness. The State of this location is the Colorado. State, the County is the Eagle. County, the location details are described as From Eagle, CO, take Brush Creek Road south to East Brush Creek Road(415)to the Fulford Cave/Lake Charles Trailhead.  Incident took place in Holy Cross Wildnerness.. and, the nearest town is Eagle. and the nearest road is Brush Creek Road."
    },
    {
        "description": "The headline of the report is Possible footprints found near Metropolis. The State of this location is the Illinois. State, the County is the Massac. County, the location details are described as (please do not post location online). and, the nearest town is Metropolis. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Backpacker meets an 8-foot hairy biped standing behind tent. The State of this location is the Colorado. State, the County is the Hinsdale. County, the location details are described as Near Jarosa Mesa down toward Rambouillet Park.. and, the nearest town is Lake City. and the nearest road is CO 149."
    },
    {
        "description": "The headline of the report is Man has repeated visits at family farm. The State of this location is the Alabama. State, the County is the Colbert. County, the location details are described as East of Muscle Shoals. [More specific directions not posted at this time due to current investigation].. and, the nearest town is Muscle Shoals, Alabama. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two sets of bigfoot trackways at Cape Blanco Beach on southern Oregon coast. The State of this location is the Oregon. State, the County is the Curry. County, the location details are described as South on US 101, turn west on Cape Blanco Hwy between Sixes River and Elk River to Cape Blanco beach along the north end towards cape.  Location within Cape Blanco State Park. and, the nearest town is Sixes. and the nearest road is Cape Blanco Hwy."
    },
    {
        "description": "The headline of the report is Campers hear loud animal \"roars\", from inside the treeline of a clear-cut. The State of this location is the Washington. State, the County is the Chelan. County, the location details are described as Washington State, south side of Little Wenatchee River on the lower slope of Mount Howard; on a logging road in a newly replanted clear-cut, just east of the Rainy Creek bridge.. and, the nearest town is Stevens Pass. and the nearest road is FR 6700."
    },
    {
        "description": "The headline of the report is Scary encounters outside a rural home near Jackson. The State of this location is the Georgia. State, the County is the Butts. County, the location details are described as Halls Bridge road runs parallel to Jackson Lake. They are many cow pastures in the area that people rarely go in.. and, the nearest town is Jackson. and the nearest road is Halls Bridge Road."
    },
    {
        "description": "The headline of the report is Two fishermen have truck shaken early one morning, outside of Auburn. The State of this location is the California. State, the County is the Placer. County, the location details are described as Take HWY 49 out of Auburn, CA, towards Grass Valley. Turn right at Alta Sierra. (I wish I could give specific directions from here, but it was a long time ago, and I wasn't driving. I remember we made our way to a small beaver pond. There was just beginning to be houses built around here, and I think the area is probably much more developed now than it was 20+ years ago...). and, the nearest town is Auburn, California. and the nearest road is I don't remember the exact road, I wasn't driving, and it was quite a whlie ago. Off Higway 49 at Alta Sierra, then a couple miles back, by a small beaver pond.."
    },
    {
        "description": "The headline of the report is Morning sighting by motorist at railroad crossing near Median. The State of this location is the New York. State, the County is the Orleans. County, the location details are described as FARMING AREA, FIELDS, WOODS AND A SMALL STREAM OR CREEK RUNS THROUGH UP THE ROAD FURTHER FROM THE SIGHTING.. and, the nearest town is MEDINA. and the nearest road is DRESSER RD./RTE.31."
    },
    {
        "description": "The headline of the report is Campers Awaken to Unknown Vocalizations, Brush Popping and Foul Odor. The State of this location is the Washington. State, the County is the Skamania. County, the location details are described as The location is the campground for hikers on Mt. St. Helens known as hikers bivouac. Campground is located at mouth of St Helens trail.. and, the nearest town is Cougar. and the nearest road is Mt St Helens Hikers bivouac."
    },
    {
        "description": "The headline of the report is Memory told of daylight sighting along railroad tracks near Granite City. The State of this location is the Illinois. State, the County is the Madison. County, the location details are described as nan. and, the nearest town is Granite City. and the nearest road is Old Rock Rd.."
    },
    {
        "description": "The headline of the report is Couple in car terrified by loud howl/scream near Carlinville. The State of this location is the Illinois. State, the County is the Macoupin. County, the location details are described as nan. and, the nearest town is Carlinville. and the nearest road is Off of Bunker Hill road."
    },
    {
        "description": "The headline of the report is Man and wife find large tracks with large stride east of Greenwater. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as forest service road 70 snowed over. and, the nearest town is greenwater. and the nearest road is highway 410."
    },
    {
        "description": "The headline of the report is Witness reports seeing footprints as a child. The State of this location is the Iowa. State, the County is the Humboldt. County, the location details are described as nan. and, the nearest town is ottosen ia. and the nearest road is now is rossing ave."
    },
    {
        "description": "The headline of the report is Motorist has a possible sighting on a rainy night near Schell City. The State of this location is the Missouri. State, the County is the Vernon. County, the location details are described as About ten miles North east of Nevada, Missouri.. and, the nearest town is Nevada, Missouri. and the nearest road is M hwy."
    },
    {
        "description": "The headline of the report is Family has encounters on private, hunting land in Red River - Sulphur River corridor. . The State of this location is the Texas. State, the County is the Fannin. County, the location details are described as 6 miles north of Honey Grove. and, the nearest town is Honey Grove. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Horse boarder hears possible vocalizations late at night west of Belgrade. The State of this location is the Montana. State, the County is the Gallatin. County, the location details are described as Approximately 4 miles west of Belgrade, Montana and 1 mile south of I-90.  3/4 of a mile east of the West Gallatin River.. and, the nearest town is Belgrade or Manhattan, MT. and the nearest road is I-90."
    },
    {
        "description": "The headline of the report is Early morning road crossing near Woodstock. The State of this location is the Virginia. State, the County is the Shenandoah. County, the location details are described as The area is Artz Road were it meets Route 11. The thing with this area, it is close to the George Washington National Forest.. and, the nearest town is Woodstock. and the nearest road is Rt. 11 & Artz Road."
    },
    {
        "description": "The headline of the report is Evening worker hears vocalizations, smells strong odor in Big Thicket. The State of this location is the Texas. State, the County is the Jasper. County, the location details are described as Edited at request of witness.. and, the nearest town is Edited at request of witness.. and the nearest road is Edited at request of witness.."
    },
    {
        "description": "The headline of the report is Possible vocal interaction with children playing at dusk near Hot Springs. The State of this location is the North Carolina. State, the County is the Madison. County, the location details are described as NC Highway 209. and, the nearest town is Hot Springs. and the nearest road is Highway 209."
    },
    {
        "description": "The headline of the report is Witness hears loud screams and foot steps while camping near Laporte. The State of this location is the Minnesota. State, the County is the Hubbard. County, the location details are described as We were camping in Gulch Lake Campground in Paul Bunyan State Forest.. and, the nearest town is Laporte, MN. and the nearest road is Hwy 200."
    },
    {
        "description": "The headline of the report is Young girls remember seeing a hair-covered creature running under a streetlight near Belmont. The State of this location is the New York. State, the County is the Allegany. County, the location details are described as Going out of Belmont, towards Alfred, after the hill just after the left turn to go down Baker Valley Rd.. and, the nearest town is Belmont, NY. and the nearest road is 244."
    },
    {
        "description": "The headline of the report is 17-18 inch tracks in the mud. The State of this location is the Washington. State, the County is the Jefferson. County, the location details are described as In forest about 4-5 miles north of Brinnon. Far from any road.. and, the nearest town is Brinnon. and the nearest road is US 101."
    },
    {
        "description": "The headline of the report is Two campers hear strange sounds and see the outline of an upright creature. . The State of this location is the Indiana. State, the County is the Brown. County, the location details are described as Indiana, Brown County, Elkinsville, Lake Monroe area. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Campers describe loud branch snap, howls, and possible track, northeast of Cougar. The State of this location is the Washington. State, the County is the Skamania. County, the location details are described as Off of 25, at a campsite on the east side of the bridge that crosses a creek in Skamania County.. and, the nearest town is Cougar. and the nearest road is Forrest service road 25."
    },
    {
        "description": "The headline of the report is Early A.M. sighting returning home from family event. The State of this location is the Missouri. State, the County is the Jefferson. County, the location details are described as http://maps.google.com/maps?hl=en&q=cedar+hill+mo&ie=UTF8&hq=&hnear=Cedar+Hill,+Jefferson,+Missouri&gl=us&ei=YFQKS92QOIO6NY-v3LYK&ved=0CAgQ8gEwAA&ll=38.387688,-90.725956&spn=0.044335,0.076475&t=h&z=14. and, the nearest town is Catawissa. and the nearest road is NN."
    },
    {
        "description": "The headline of the report is Teacher sees a bigfoot cross the highway in front of her near Aberdeen. The State of this location is the Washington. State, the County is the Grays Harbor. County, the location details are described as (Edited) I could show you exactly where this figure came from and dissapeared into the woods. Please feel free  contact me if you need to.. and, the nearest town is Aberdeen. and the nearest road is Hwy 105."
    },
    {
        "description": "The headline of the report is Woman delivering newspapers hears possible vocalizations near Randle. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as East end of Silverbrook Rd. and, the nearest town is Randle. and the nearest road is Hwy 12 and Silverbrook rd."
    },
    {
        "description": "The headline of the report is Young man recalls encounter behind his house and close to the Meander Creek Reservoir. The State of this location is the Ohio. State, the County is the Mahoning. County, the location details are described as I was between route 224 and Mahoning Ave.  Austintowns water comes from Meander Reservoir which is protected by park rangers.  We were within a mile from the reservoir but exact location within the forrest is unknown due to the production of housing developments within the past few years.. and, the nearest town is Austintown. and the nearest road is Mahoning Ave.."
    },
    {
        "description": "The headline of the report is Nighttime sighting near Goeldner Woods County Park. The State of this location is the Iowa. State, the County is the Madison. County, the location details are described as The sighting occurred on Hogback Bridge Rd. Coming south on 169 out of De Soto, you'd want to take a right on G14 and a left on Hogback Bridge. The sighting ocurred just after the T intersection about half a mile down the road.. and, the nearest town is Earlham. and the nearest road is Highway 169."
    },
    {
        "description": "The headline of the report is Possible road crossing observed at dusk by a truck driver on I-75 south of Cordele. The State of this location is the Georgia. State, the County is the Crisp. County, the location details are described as nan. and, the nearest town is Arabi, GA. and the nearest road is I-75 between Mile Markers 89 and 91."
    },
    {
        "description": "The headline of the report is Young ape-like creature seen squatting on a tree limb near Shingleton. The State of this location is the Michigan. State, the County is the Schoolcraft. County, the location details are described as Approx. 2 miles south of Shingleton on M-94 and 4 to 5 miles west.   (Hiawatha National Forest, northeast section). and, the nearest town is Shingleton ,. and the nearest road is M-94."
    },
    {
        "description": "The headline of the report is Hikers find a large track. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as North Fork of the Skokomish River.. and, the nearest town is Potlach. and the nearest road is Skokomish Valley Rd.."
    },
    {
        "description": "The headline of the report is Rooks Park Investigation. The State of this location is the Washington. State, the County is the Walla Walla. County, the location details are described as take mill creek road to the rooks park turn off and follow till you reach Rooks Park. and, the nearest town is Walla Walla. and the nearest road is Mill Creek Road."
    },
    {
        "description": "The headline of the report is Witness sees unknown animal cross dirt road near New Mexico State Route 264. The State of this location is the New Mexico. State, the County is the McKinley. County, the location details are described as nan. and, the nearest town is Rocksprings,NM. and the nearest road is Highway 264."
    },
    {
        "description": "The headline of the report is Wood knocking and tree shaking noticed while deer hunting. The State of this location is the Michigan. State, the County is the Oscoda. County, the location details are described as (edited). and, the nearest town is McKinley, MI. and the nearest road is Old State Rd, Rt 600, in McKinley."
    },
    {
        "description": "The headline of the report is Deer hunter reports possible activity in the Freedom Hills Management Area near Cherokee. The State of this location is the Alabama. State, the County is the Colbert. County, the location details are described as Take Hi-way 72 west towards Memphis. and, the nearest town is Cherokee Alabama. and the nearest road is Coon Dog Cemetery Road."
    },
    {
        "description": "The headline of the report is Adolescent child has early morning sighting near Chatsworth. The State of this location is the Georgia. State, the County is the Murray. County, the location details are described as IT WAS REMOTLY CLOSE TO THE WOODS.. and, the nearest town is CHATSWORTH. and the nearest road is [removed]."
    },
    {
        "description": "The headline of the report is While scouting a timbered hill at 7000', hikers see a bipedal animal stand up & walk away. The State of this location is the Montana. State, the County is the Park. County, the location details are described as a cliffband on top of a timbered hill at about 7000' on west side of Crazy Mountains. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man recalls a vivid daytime encounter as a youth near Portland. The State of this location is the Tennessee. State, the County is the Sumner. County, the location details are described as A day or so later, J told me that he accompanied his father, along with some other friends, to the spot where we'd had found the trees. Said the knife was still in the ground. Mentioned that they found additional tracks.. and, the nearest town is Portland. and the nearest road is Highway 76."
    },
    {
        "description": "The headline of the report is Possible stalking near Salt Fork Lake spillway (drains into Wills Creek). The State of this location is the Ohio. State, the County is the Guernsey. County, the location details are described as The first county road off state rt. 21 ( Old 21 Road) to the left just before you go under I 77. Possibly Bell Rd. but I'm not sure of the name. Then approx. 1/8 mi. and on the left is Salt Fork Lake spillway. It drains into Wills Creek about 1/2 mi. down stream.. and, the nearest town is North Salem, Ohio. and the nearest road is State Rt. 21."
    },
    {
        "description": "The headline of the report is Campers have encounter at night close to Tappan Lake. The State of this location is the Ohio. State, the County is the Harrison. County, the location details are described as My place is two miles off CR 37. State Route 250 is about three miles south on CR 37.. and, the nearest town is Dennison/Uhrichsville, Ohio. and the nearest road is County Road 37 in Monroe Twp.."
    },
    {
        "description": "The headline of the report is Motorist has nightime sighting near Harmony. The State of this location is the New Jersey. State, the County is the Warren. County, the location details are described as forested wetland at the base of a ridge on southeast side and agricultural field on west. whatever it was it crossed west to east. and, the nearest town is Harmony. and the nearest road is ridge road."
    },
    {
        "description": "The headline of the report is Father and two sons see a sasquatch near Holiday Island. The State of this location is the Arkansas. State, the County is the Carroll. County, the location details are described as nan. and, the nearest town is Holiday island. and the nearest road is Hwy 23 s."
    },
    {
        "description": "The headline of the report is Man shares encounters of an unknown subject. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as Contact me. and, the nearest town is Shelton. and the nearest road is Cloquallum."
    },
    {
        "description": "The headline of the report is Possible encounter disturbs a camper in a high country forest. The State of this location is the Arizona. State, the County is the Coconino. County, the location details are described as I do not wish to divulge the exact location.. and, the nearest town is Payson AZ. and the nearest road is FR 300."
    },
    {
        "description": "The headline of the report is Large prints found in mud and then vocalizations heard south of Yakama Reservation. The State of this location is the Washington. State, the County is the Klickitat. County, the location details are described as I know exactly how to get there but I don't remember the Hwy leading W out of Goldendale but stay on it then you come up to block house. Drive through and keep following the hwy for about 4 miles you come to a sharp 20 mile corner and instead of taking the corner go straight off the road.  It becomes gravel road.  Follow it for about 5 miles then you should come to an old run down homestead off to your left that open field is where this took place ...This is known as the Grayback mountain range  leading up to Mt Adams. and, the nearest town is Goldendale. and the nearest road is Hwy leading west out of Goldendale."
    },
    {
        "description": "The headline of the report is Man has early morning sighting near Sly Park. The State of this location is the California. State, the County is the El Dorado. County, the location details are described as nan. and, the nearest town is Pollock Pines. and the nearest road is Sly Park road about 3 miles from Highway 50."
    },
    {
        "description": "The headline of the report is Two teenage girls have daytime encounter on Big Sur Coast. The State of this location is the California. State, the County is the Monterey. County, the location details are described as It was at a campground in Big Sur California.  I can't remember which one.. and, the nearest town is Gorda. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Nature photogapher hears possible woodknocks on Skyline Drive. The State of this location is the Virginia. State, the County is the Rockingham. County, the location details are described as Directions to Shenandoah National Park can be easily found.. and, the nearest town is Elkton. and the nearest road is Skyline Driver near Rt. 33."
    },
    {
        "description": "The headline of the report is Deer hunter has early morning encounter near Middleton. The State of this location is the Tennessee. State, the County is the Hardeman. County, the location details are described as 10 miles south of middleton ,tn. and, the nearest town is Middleton. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Hikers spot a dark figure walking on a snowy mountainside near Winnemucca. The State of this location is the Nevada. State, the County is the Humboldt. County, the location details are described as You can see the mountain from on the outskirt's of town. You can basicaly see the peak of the mountain that the sighting occured.. and, the nearest town is Winnemucca. and the nearest road is There was a little dirt road. I don't even think it was marked.."
    },
    {
        "description": "The headline of the report is Multiple incidents near rural home outside Adel. The State of this location is the Georgia. State, the County is the Cook. County, the location details are described as Between Adel and Boyette Town Road. and, the nearest town is Adel, GA. and the nearest road is Val Del Rd.."
    },
    {
        "description": "The headline of the report is Deer hunters find footprints in Wildell Bottom. The State of this location is the West Virginia. State, the County is the Pocahontas. County, the location details are described as Not sure of rt # gravel road between Durbin and Bemis camped at a place called Wildell Bottom.. and, the nearest town is Durbin / Elkins. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Memory told of encounter at a remote cabin at Sandy Run. The State of this location is the Illinois. State, the County is the White. County, the location details are described as nan. and, the nearest town is Eldorado. and the nearest road is The highway going to Harrisburg. Not certain."
    },
    {
        "description": "The headline of the report is Loud vocalizations repeatedly disturb family. The State of this location is the Washington. State, the County is the Whatcom. County, the location details are described as Incident took place behind our A-frame house one half mile north of the North Fork of the Nooksack River and at the base of Black Mt. and  quarter mile northeast of Boulder Creek. Take I-5 north until you get to Bellingham, take sunset Mt. Baker Hwy. exit continue eastbound for1 & half hour you will see Boulder Creek. Quarter mile on left, past Baptist camp is the location .. and, the nearest town is Maple Falls. and the nearest road is Mt.Baker Hwy."
    },
    {
        "description": "The headline of the report is Recalling a morning sighting as a teenager horseback riding near Marblemount. The State of this location is the Washington. State, the County is the Skagit. County, the location details are described as It has been so long and many changes in the area I don't know where it is. The Jim Clark Dude Ranch is out of business.. and, the nearest town is Marblemount. and the nearest road is North Cascades Highway."
    },
    {
        "description": "The headline of the report is Police Officers hear unusual vocalizations at remote camp. The State of this location is the Pennsylvania. State, the County is the Clinton. County, the location details are described as Located near the town of Hamersly Fork in the direction of Alvin Bush Dam. The location is off the road ( not able to recall exact name but leads directly to Alvin Bush Dam and opposite way goes into Cross Forks) at Beaver Dam Road.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two decades separate sightings of father and son at farm. The State of this location is the Missouri. State, the County is the Gasconade. County, the location details are described as Withheld by request.. and, the nearest town is Bland. and the nearest road is Hyw B."
    },
    {
        "description": "The headline of the report is Tracks found along soybean field near Edinburgh. The State of this location is the Ohio. State, the County is the Portage. County, the location details are described as nan. and, the nearest town is Edinburgh. and the nearest road is Tallmadge Rd.."
    },
    {
        "description": "The headline of the report is Hunting/fishing partner related to a friend he saw something over 6' stand on it's hind legs and quickly walk 40 to 50 yards near Hells Canyon. The State of this location is the Oregon. State, the County is the Baker. County, the location details are described as I am a little ruluctant to say exactly where this sighting occured. The person that gave me this information probably doesn't want a lot of people to know about it. I will give the exact location to an investigator if they wish to contact me.. and, the nearest town is Baker, Or. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man tells of the strange occurrences and his sighting as a teenager near Buckhart. The State of this location is the Illinois. State, the County is the Sangamon. County, the location details are described as North of Buckhart on Young Road.. and, the nearest town is Rochester. and the nearest road is Country Road 4."
    },
    {
        "description": "The headline of the report is Campers awakened by strange howls while camping near Sanford. The State of this location is the Virginia. State, the County is the Accomack. County, the location details are described as nan. and, the nearest town is Sanford VA 23426 is where this happened. and the nearest road is CR 695 Accomack County."
    },
    {
        "description": "The headline of the report is Hikers observe a tall human-like figure near Rawley Springs. The State of this location is the Virginia. State, the County is the Rockingham. County, the location details are described as We had parked on the side of the road at blue hole on 33 and started hiking from there. We where approximately 2 miles up into the forest.. and, the nearest town is Rawley Springs, Virginia. and the nearest road is Rt..33."
    },
    {
        "description": "The headline of the report is Driver startled to see a tall figure next to U.S. Hwy. 151 near Mineral Point. The State of this location is the Wisconsin. State, the County is the Iowa. County, the location details are described as Around mile marker 36 on Hwy 151 southbound.. and, the nearest town is Mineral Point. and the nearest road is Hwy 151 southbound."
    },
    {
        "description": "The headline of the report is At Sabbathday Point, Family Reports strange sounds near their cabin. The State of this location is the New York. State, the County is the Warren. County, the location details are described as Warren County, New York. Adirondack Mountains, Lake George, Sabbathday Point. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Bigfoot sighted in Stony Lagoon  south of Orick,Ca by two men camping who were so frightened they left in middle of night. . The State of this location is the California. State, the County is the Humboldt. County, the location details are described as Stony Lagoon  South of Orick,Ca is 1/4 mi west of coast hiway and is a well known camp ground.(now!). and, the nearest town is Orick,Ca. and the nearest road is 1/4 Mi.west of coast hiway."
    },
    {
        "description": "The headline of the report is Two sets of tracks found near Lake DeGray. The State of this location is the Arkansas. State, the County is the Hot Spring. County, the location details are described as This area is in the Arlie Moore area of the corp land surrounding Lake DeGray.. and, the nearest town is Bismarck. and the nearest road is Hwy 7."
    },
    {
        "description": "The headline of the report is Strange occurrences outside a home lead to a daylight sighting by a father and son near East Canton. The State of this location is the Ohio. State, the County is the Stark. County, the location details are described as About 1/4 mile north of Route 30. and, the nearest town is East Canton. and the nearest road is Route 30."
    },
    {
        "description": "The headline of the report is While conducting sound survey project, two team members see Bigfoot. The State of this location is the California. State, the County is the Humboldt. County, the location details are described as from 101 past Orick about one mile turn right at Lady Bird Johnson Grove (AKA Bald Hills Road).  Go up about ten miles to a Fire station located on left.   Turn down that road and continue about eight miles to a large clearcut.. and, the nearest town is Johnson. and the nearest road is Bald Hills Road."
    },
    {
        "description": "The headline of the report is Man recalls seeing a huge, hair-covered biped standing beside the road at night near Snohomish. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Iverson rd. 171st ave  right where the power lines cross.  Take Hwy 2 From Snohomish and turn left on 100th street.  Follow that all the way till it turns north and becomes 171st ave.  The power lines are about 1 mile or a little more north on 171st.  It was on the left. and, the nearest town is Snohomish. and the nearest road is 171st ave  (also called Ivarson)."
    },
    {
        "description": "The headline of the report is Another possible encounter along Appalachian Trail. The State of this location is the Massachusetts. State, the County is the Berkshire. County, the location details are described as South Of Tyringham, Mass north of Great Barrington Mass. and, the nearest town is Great Barrington Mass. and the nearest road is Mass Rt 23."
    },
    {
        "description": "The headline of the report is Early morning sighting by bat survey crew. The State of this location is the West Virginia. State, the County is the Boone. County, the location details are described as [location details edited: a surface mine in Boone County]. and, the nearest town is Ridgeview, WV. and the nearest road is Route 3."
    },
    {
        "description": "The headline of the report is Creature Seen Heading Down Towards the Lake. . The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as California, Shasta County, Castle Lake. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Man recounts his possible daytime sighting while bowhunting near Crestview. The State of this location is the Florida. State, the County is the Okaloosa. County, the location details are described as 30.905288, -86.683717. and, the nearest town is Blackman. and the nearest road is Highway 4."
    },
    {
        "description": "The headline of the report is Vocalizations heard on remote piece of Arkansas property. The State of this location is the Arkansas. State, the County is the Hot Spring. County, the location details are described as Witness requested that location not be disclosed.. and, the nearest town is Bismark. and the nearest road is Confidential.."
    },
    {
        "description": "The headline of the report is Worker has late night encounter at gas well near Aledo. The State of this location is the Texas. State, the County is the Parker. County, the location details are described as Hwy 5 south of Aledo. and, the nearest town is Aledo. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Large dark animal spotted wading in shallows of lake. The State of this location is the Maryland. State, the County is the Baltimore. County, the location details are described as I think I described it well enough in the begining. I just don't want to be ridiculed about this.. and, the nearest town is *****************. and the nearest road is *****************."
    },
    {
        "description": "The headline of the report is Hiker hears possible vocalizations on Appalachian Trail outside Helen. The State of this location is the Georgia. State, the County is the White. County, the location details are described as [Exact location omitted] on the Appalachian trail. and, the nearest town is Helen. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Teenager hears unusual daytime vocalization near Courtright Reservoir. The State of this location is the California. State, the County is the Fresno. County, the location details are described as Provided in the main part of my report. and, the nearest town is It might be Shaver Lake, but it is hard to tell. At any rate, we were a very long way from Shaver Lake or any other town, up in the mountains. We parked the car at Courtright Reservoir.. and the nearest road is Courtright Road -- the road that leads to the dam at Courtright Reservoir.."
    },
    {
        "description": "The headline of the report is Back seat passsenger in car has observation between Florence and Canyon City. The State of this location is the Colorado. State, the County is the Fremont. County, the location details are described as When you come in from Pueblo headed towards Canon City you will see a sign on the right that says Phantom Canyon and It is also I short cut to Cripple Creek and the back way to Colorado Springs.. and, the nearest town is between Florence and Canyon City Colorado. and the nearest road is I think HWY 87."
    },
    {
        "description": "The headline of the report is Loud vocalizations sounds heard. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as nan. and, the nearest town is Gig Harbor. and the nearest road is Hwy 16."
    },
    {
        "description": "The headline of the report is Possible stalking at rural school bus stop near Benzonia, Michigan. The State of this location is the Michigan. State, the County is the Benzie. County, the location details are described as nan. and, the nearest town is Benzonia. and the nearest road is M115 east."
    },
    {
        "description": "The headline of the report is Father and son are approached by three large bipeds while fishing at dusk west of Asbury. The State of this location is the Iowa. State, the County is the Dubuque. County, the location details are described as Public access area, secluded, running water, and wooded. and, the nearest town is Graf. and the nearest road is Twin Springs Drive."
    },
    {
        "description": "The headline of the report is Coon hunters shadowed for 20 minutes at night in Cardinal Marsh public hunting area. The State of this location is the Iowa. State, the County is the Winneshiek. County, the location details are described as It happened at Cardinal Marsh public hunting area. and, the nearest town is Cresco Iowa. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Campers hear possible vocalizations in the Okanogon Nat. Forest. The State of this location is the Washington. State, the County is the Okanogan. County, the location details are described as The campground is about 5 miles west of Mazama on. and, the nearest town is Mazama, WA. and the nearest road is Highway 20."
    },
    {
        "description": "The headline of the report is Vocalization, followed by sighting near Carnation/Fall City. The State of this location is the Washington. State, the County is the King. County, the location details are described as It was somewhere near Carnation and Fall City. There was a water treatment plant or reservoir.. and, the nearest town is Carnation,Fall City. and the nearest road is Cant remember, it was near a reservoir."
    },
    {
        "description": "The headline of the report is Son and father hear possible sasquatch vocalizations in the Emigrant Wilderness. The State of this location is the California. State, the County is the Tuolumne. County, the location details are described as Going to Pinecrest or Strawberry, then go towards the dodge ski lodge, and take the road that leads you to crab tree trail head and then Bear Lake is the first or second lake in Emigrant National Wilderness(after the sign).. and, the nearest town is Pinecrest/Strawberry. and the nearest road is sonora pass highway/108."
    },
    {
        "description": "The headline of the report is Sighting of two animals walking a ridge line in Salt Fork State Park. The State of this location is the Ohio. State, the County is the Guernsey. County, the location details are described as It was in Salt Fork State Park itself on Shadebush Trail.. and, the nearest town is Salt Fork State Park. and the nearest road is Shadebush Trail."
    },
    {
        "description": "The headline of the report is Hunter describes powerful wood knocks at a cabin in remote wilderness south of the town of Chicken. The State of this location is the Alaska. State, the County is the Southeast Fairbanks. County, the location details are described as This is near Ketchumstock Mountain, about a 30 mile jaunt by ATV's to the west of the Taylor Highway south of Chicken Alaska.. and, the nearest town is Chicken, Alaska. and the nearest road is Taylor Highway."
    },
    {
        "description": "The headline of the report is Hunter has close sighting of a primate-like creature in the Canaan Valley National Wildlife Refuge. The State of this location is the West Virginia. State, the County is the Tucker. County, the location details are described as I do not know the name of the road that leads to this area of the refuge, though it is easy to find. Simply turn left off of US Route 32 in front of the small shopping center clearly visible as you start to exit Davis, upon turning left continue on a straight path until you cross a small wooden bridge. After crossing the bridge stay on this road and it will lead directly to the Camp 70 parking area.. and, the nearest town is Davis. and the nearest road is US Highway Route 32."
    },
    {
        "description": "The headline of the report is Possible activity on a farm with beef cattle near Kingston. The State of this location is the New York. State, the County is the Ulster. County, the location details are described as nan. and, the nearest town is City: Kingston. Town: Port Ewen. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Daylight encounter while hiking on the Tulalip Indian Reservation. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as Removed at the request of the witness.. and, the nearest town is Tulalip. and the nearest road is Between Interstate-5 and Whidbey island."
    },
    {
        "description": "The headline of the report is Camping family has auditory and olfactory encounter in early evening southeast of Dorena Lake. The State of this location is the Oregon. State, the County is the Lane. County, the location details are described as The campground is about 8 miles SE of Dorena Lake.. and, the nearest town is Cottage Grove. and the nearest road is Sharps Creek."
    },
    {
        "description": "The headline of the report is City planner sees large upright animal while touring property near Punta Gorda. The State of this location is the Florida. State, the County is the Charlotte. County, the location details are described as From I75 south take exit #164, take US17/Duncan Rd north 1 miles to74/Bermont Rd, go right on 17 about 15 miles. At flashing light rurn right onto SR31. Go about 6 miles, entrance to the Wilderness Park will be on the left.. and, the nearest town is Punta Gorda Fl. and the nearest road is State Route 31."
    },
    {
        "description": "The headline of the report is While hunting in Sabine River bottoms, two boys have daytime encounter. The State of this location is the Texas. State, the County is the Gregg. County, the location details are described as Gladewater. Hwy 80 east to Lockerplant Rd. Follow into river bottoms approx.1.5 miles.. and, the nearest town is Gladewater. and the nearest road is Hwy 80 and Lockerplant Rd.."
    },
    {
        "description": "The headline of the report is Teen views ape-like animal crossing road quadrupedally at night in Enumclaw. The State of this location is the Washington. State, the County is the King. County, the location details are described as nan. and, the nearest town is Enumclaw. and the nearest road is 295th and 416th."
    },
    {
        "description": "The headline of the report is Two girls witness a large, hair covered baboon like creature squatting in the middle of the road. The State of this location is the Ohio. State, the County is the Licking. County, the location details are described as South of State Route 16 on Brownsville Road just south of the Claylick Bridge.. and, the nearest town is Claylick. and the nearest road is Brownsville Road."
    },
    {
        "description": "The headline of the report is Possible nighttime sighting while driving over a bridge near Charlemont. The State of this location is the Massachusetts. State, the County is the Franklin. County, the location details are described as See my post, near MP 410 on the railroad track, overhead route 2 bridge. and, the nearest town is Charlemont. and the nearest road is Rt 2."
    },
    {
        "description": "The headline of the report is Possible daylight sighting by boy near Meridian. The State of this location is the Mississippi. State, the County is the Lauderdale. County, the location details are described as Not Available. and, the nearest town is Meridian. and the nearest road is dont remember."
    },
    {
        "description": "The headline of the report is ATV riders near Berea have scary ride out of woods at night. The State of this location is the Kentucky. State, the County is the Madison. County, the location details are described as nan. and, the nearest town is Berea. and the nearest road is US25."
    },
    {
        "description": "The headline of the report is 78 year-old life-long woodsman finds tracks along the Apalachicola River. The State of this location is the Florida. State, the County is the Liberty. County, the location details are described as nan. and, the nearest town is 20 MILES SOUTH OF BRISTOL FLA.. and the nearest road is HI WAY 12 SOUTH."
    },
    {
        "description": "The headline of the report is Husband and wife see large upright figure leap from road around midnight on Freezeout Saddle near Clarkia. The State of this location is the Idaho. State, the County is the Shoshone. County, the location details are described as Freezeout saddle, Grandmother mountain area. and, the nearest town is Clarkia Idaho. and the nearest road is Freezeout road near Idaho highway 3."
    },
    {
        "description": "The headline of the report is Creature observed running on hind legs. The State of this location is the Colorado. State, the County is the San Juan. County, the location details are described as My husband myself and my son and nephew were backpacking in the San Juan Mountains in Colorado the days of July 25th and 26th of this year 1998. We were in the area of the Twin Sisters mountain tops, south of Silverton about four miles in on a pack trail following the Lime Creek.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Motorists have nighttime sighting on outskirts of Lawrenceville. The State of this location is the Illinois. State, the County is the Lawrence. County, the location details are described as What ever it was it came from the left to right by some grain bins across 12th Street. It took just seconds to run across the road going west.  We are rural here at my location.. and, the nearest town is Lawrenceville. and the nearest road is 12th Street and Adams."
    },
    {
        "description": "The headline of the report is Possible knocks, vocalizations and footprints found outside a home near Leitchfield. The State of this location is the Kentucky. State, the County is the Grayson. County, the location details are described as We are on the banks of rough river. Our home is located between the river and 1000's of acres of forest and cornfields.. and, the nearest town is Leitchfield. and the nearest road is 737."
    },
    {
        "description": "The headline of the report is Family sees prints near Crescent City. The State of this location is the California. State, the County is the Del Norte. County, the location details are described as nan. and, the nearest town is Crescent City. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Family has sightings and encounters in Santa Cruz mountains. The State of this location is the California. State, the County is the Santa Cruz. County, the location details are described as nan. and, the nearest town is Aptos. and the nearest road is Eureka Canyon."
    },
    {
        "description": "The headline of the report is Family has early evening sighting near Weed. The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as There is a monument or marker near the dirt road where you turn off the main Hwy (about 10 mi. north of Weed).  I have not been there in a very long time.. and, the nearest town is Weed. and the nearest road is Old Oregon Trail."
    },
    {
        "description": "The headline of the report is Late-night sighting by motorist couple between Homerville and Edith. The State of this location is the Georgia. State, the County is the Clinch. County, the location details are described as nan. and, the nearest town is between Homerville and Edith. and the nearest road is on US 441 southbound."
    },
    {
        "description": "The headline of the report is Two hunters hear vocalizations they cannot identify near Randle. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as From FR 23 heading south, turn right on Road 2504.  About a mile in, there is a closed road on the right hand side.  You must then hike in about 1.5 miles (following the left fork) up to its end.  That's where the encounter occurred.. and, the nearest town is Randle. and the nearest road is FR 23."
    },
    {
        "description": "The headline of the report is Possible vocalizaitons heard approx. two miles from Sabbath Day Point. The State of this location is the New York. State, the County is the Warren. County, the location details are described as (exact location withheld by request). and, the nearest town is sabbath day point. and the nearest road is route 9N."
    },
    {
        "description": "The headline of the report is Trucker couple report daytime road-crossing sighting near Sula. The State of this location is the Montana. State, the County is the Ravalli. County, the location details are described as Steep mountain side to our left.  River to our right.. and, the nearest town is Conner. and the nearest road is SR93."
    },
    {
        "description": "The headline of the report is Morning hike turns a veterinarian and her family into believers near Missoula. The State of this location is the Montana. State, the County is the Missoula. County, the location details are described as The Waterworks Trail. and, the nearest town is Missoula, Montana. and the nearest road is I-90."
    },
    {
        "description": "The headline of the report is Couple driving home has night time sighting near Tres Piedras. The State of this location is the New Mexico. State, the County is the Taos. County, the location details are described as It was just North of the road on Hwy 285 from the flashing light of Tres Piedras, New Mexico right where there is a wall of rocks on each side of the road. by the Per-light.. and, the nearest town is Tres Piedras- Antonito. and the nearest road is it was on Hwy 285."
    },
    {
        "description": "The headline of the report is Young man has road cross encounter at dusk. The State of this location is the Oklahoma. State, the County is the Le Flore. County, the location details are described as West on Holson Valley Road, west of Cedar Lake.. and, the nearest town is Hodgen. and the nearest road is Holsun Valley Road, between Highways 271 & 270."
    },
    {
        "description": "The headline of the report is Possible howl heard at night near Arcadia Valley . The State of this location is the Missouri. State, the County is the Iron. County, the location details are described as Area of Highway E close to Highway 21. and, the nearest town is Arcadia Valley. and the nearest road is E Hwy."
    },
    {
        "description": "The headline of the report is Horse trainer hears frightening vocalizations near Shelton. The State of this location is the Washington. State, the County is the Mason. County, the location details are described as Edited to protect the location by the investigator.. and, the nearest town is Shelton. and the nearest road is Hwy 101 and Old Olympic Hwy."
    },
    {
        "description": "The headline of the report is River rafter has rocks thrown toward him while hiking near Sheepeater Hot Springs. The State of this location is the Idaho. State, the County is the Custer. County, the location details are described as River left, approx 13.2 miles down river from Boundry Creek boat launch on the Middle Fork of the Salmon River in ID. Scout camp where we stayed is just below Powerhouse rapids a class IV. It was on the hill to my left and next to a calmer section of the river.. and, the nearest town is Stanley, ID. and the nearest road is Hike in or fly out on a dirt runway."
    },
    {
        "description": "The headline of the report is Man sees ape-like animal in back yard. The State of this location is the Maryland. State, the County is the Harford. County, the location details are described as Fallston, Maryland Not far from the Little Gunpowder river. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is A Local Writer Discusses Her Experiences Pursuing Local Reports and Legends. The State of this location is the California. State, the County is the San Diego. County, the location details are described as nan. and, the nearest town is Julian. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Several people witness 7 to 8 foot tall creature on an old mining road. The State of this location is the Kentucky. State, the County is the Pike. County, the location details are described as Near Virgie Kentucky, nearest road is 1469,  on an old auger mining road less than 10 miles North east of the Jefferson National Forest. and, the nearest town is Virgie. and the nearest road is 1469."
    },
    {
        "description": "The headline of the report is Memory told of a daylight sighting and parallel chase in the Gila River bottoms while riding horseback. The State of this location is the Arizona. State, the County is the Maricopa. County, the location details are described as It was North of a farm on the North side of Watermelon road, that ended where the river bed starts.. and, the nearest town is Gila Bend. and the nearest road is Watermelon road."
    },
    {
        "description": "The headline of the report is A bicyclist's daylight, partial sighting of a large animal with a rancid smell. The State of this location is the New York. State, the County is the Chemung. County, the location details are described as Route 13 to Route 223 towards Breesport.. and, the nearest town is Breesport. and the nearest road is Rout 223."
    },
    {
        "description": "The headline of the report is ATV riders descibe dusk encounter in the Monte Cristo Range. The State of this location is the Utah. State, the County is the Cache. County, the location details are described as nan. and, the nearest town is Huntsville. and the nearest road is Ant flat road."
    },
    {
        "description": "The headline of the report is River guide sees skinny bigfoot at dusk. The State of this location is the New Mexico. State, the County is the San Juan. County, the location details are described as There is a turn off to the right of the highway just before the ten mile marker. It's about ten miles to the river. We had just come up out of the first canyon to a small flat area when this incidence occured.. and, the nearest town is Shiprock, Teec Nos Pos. and the nearest road is Highway out of Shiprock, heading toward Az.."
    },
    {
        "description": "The headline of the report is Three college students witness a large creature standing just off of the railroad tracks.  . The State of this location is the Ohio. State, the County is the Athens. County, the location details are described as The location would be on the property of Hocking Technical College between the Railroad bridge and the campus security building.. and, the nearest town is Nelsonville. and the nearest road is State Route 33."
    },
    {
        "description": "The headline of the report is Possible sighting by motorist beside Highway 101 between Orick and Trinidad. The State of this location is the California. State, the County is the Humboldt. County, the location details are described as nan. and, the nearest town is Orick,ca. and the nearest road is 101."
    },
    {
        "description": "The headline of the report is Early morning commuter swerves to miss tall hairy figure near Grain Valley. The State of this location is the Missouri. State, the County is the Jackson. County, the location details are described as There are a few houses with acreage in the area;. and, the nearest town is Grain Valley. and the nearest road is Ryan Road."
    },
    {
        "description": "The headline of the report is Resident has recent daylight sighting while retrieving cattle near Godfrey. The State of this location is the Illinois. State, the County is the Madison. County, the location details are described as nan. and, the nearest town is Godfrey. and the nearest road is N. Humbert Road."
    },
    {
        "description": "The headline of the report is Rock clacking heard near Cardinal Marsh south of Cresco. The State of this location is the Iowa. State, the County is the Winneshiek. County, the location details are described as About 5 miles south of the town of Cresco.. and, the nearest town is Cresco. and the nearest road is 275th street."
    },
    {
        "description": "The headline of the report is Nighttime sighting by four witnesses, near Plainwell. The State of this location is the Michigan. State, the County is the Kalamazoo. County, the location details are described as nan. and, the nearest town is Plainwell, MI. and the nearest road is (edited)."
    },
    {
        "description": "The headline of the report is Saturday morning sighting by a motorist on William's Road. The State of this location is the Ohio. State, the County is the Franklin. County, the location details are described as nan. and, the nearest town is nan. and the nearest road is William’s Road near Alum Creek Drive."
    },
    {
        "description": "The headline of the report is Woman remembers observing a bi-pedal hair-covered adult and youth while driving near Bronson. The State of this location is the Florida. State, the County is the Levy. County, the location details are described as there are no main arteries (interstates) running though Chiefland or the surrounding small burgs. Two US highways merge in Chiefland, US 19 and 27. 27 south will take you to Bronson and around the bend mentioned in my story.. and, the nearest town is Bronson. and the nearest road is US 27."
    },
    {
        "description": "The headline of the report is Biologist observes a biped on a ridge outside Missoula. The State of this location is the Montana. State, the County is the Missoula. County, the location details are described as It was in the Lavalle Creek area on private lands.. and, the nearest town is Missoula. and the nearest road is Butler Creek Road."
    },
    {
        "description": "The headline of the report is Backpackers find long, oval shaped nests, three miles from camp. The State of this location is the Arkansas. State, the County is the Madison. County, the location details are described as Across the border from Missouri close to Fayettville Arkansas. About 20 miles east of town.. and, the nearest town is Fayettville. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Camper Awakened by Loud Wood Knocks in Talladega National Forrest. The State of this location is the Alabama. State, the County is the Clay. County, the location details are described as (topozone.com map 33° 27.85'N, 85° 52.21'W - across road from red #13 about 200 yds. )  This is in the Talladega National Forest on the Pinhote Trail SE of McDill Point and NW of Odum Trail, on the SE side of Henderson Peak (as pointed out by the Troop Leader).. and, the nearest town is Unknown/Talladega National Forest. and the nearest road is State 281."
    },
    {
        "description": "The headline of the report is Sasquatch crosses road in Coast Range in front of car. The State of this location is the Oregon. State, the County is the Polk. County, the location details are described as About 1/4 mile west of Murphy Hill summit in coast range on a long straightaway. and, the nearest town is Grande Ronde. and the nearest road is Hwy 18."
    },
    {
        "description": "The headline of the report is Witness relates rock throwing encounter while camped along the Buffalo River. The State of this location is the Tennessee. State, the County is the Perry. County, the location details are described as nan. and, the nearest town is Flat woods, linden. and the nearest road is 13."
    },
    {
        "description": "The headline of the report is Hunter encounters freakishly large tracks in a field south of Cresco. The State of this location is the Iowa. State, the County is the Winneshiek. County, the location details are described as I don't wish to give exact locations at this time, but down the road is very possible.. and, the nearest town is cresco. and the nearest road is gravel road."
    },
    {
        "description": "The headline of the report is 02/15/04 Rensselaer County, NY: Vocalizations, with Tracks Found the Next Day. The State of this location is the New York. State, the County is the Rensselaer. County, the location details are described as nan. and, the nearest town is Petersburgh, NY. and the nearest road is State Route 22."
    },
    {
        "description": "The headline of the report is Morning sighting by three fishermen near the east end of Riffe Lake. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as There was actually a highway closer than SR 12 but I don't know what it is called.  We put in on Riffe Lake @ Mossyrock State Park and ran all the way up the lake to Kosmos.  We were at a point in view of what is called the \"fishing bridge\" and there is a highway there.. and, the nearest town is Mossyrock. and the nearest road is SR 12?."
    },
    {
        "description": "The headline of the report is Man recounts two experiences with bigfoot while camping in the Lower Peninsula. The State of this location is the Michigan. State, the County is the Oscoda. County, the location details are described as camp 2 mi east 33 3 mi s mio. and, the nearest town is Mio. and the nearest road is 33."
    },
    {
        "description": "The headline of the report is Family observes large biped from car. The State of this location is the Alaska. State, the County is the Prince of Wales. County, the location details are described as Between the sort yard and the garbage dump, on Saltery Road.. and, the nearest town is Hydaburg. and the nearest road is Saltery Road."
    },
    {
        "description": "The headline of the report is Daytime encounter by two people near Rock Creek Road. The State of this location is the Idaho. State, the County is the Cassia. County, the location details are described as South of Hansen, Rock Creek Road, almost to the. and, the nearest town is about 22 miles from town in the sawtooth forrest. and the nearest road is about 2 miles from the hwy. on a dirt road."
    },
    {
        "description": "The headline of the report is Family finds large tracks going through their yard near Cle Elum. The State of this location is the Washington. State, the County is the Kittitas. County, the location details are described as Address of the witness removed by the investigator.. and, the nearest town is Cle Elum. and the nearest road is Goat Peak Ranch Road."
    },
    {
        "description": "The headline of the report is Soldier sees large figure while on patrol at Fort Lewis. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as This occurred in 1971 so if you could locate the barricks area of Company E 4th Battalion 2nd Brigade. You will find the location.. and, the nearest town is Ft.Lewis. and the nearest road is unknown."
    },
    {
        "description": "The headline of the report is Soldier on maneuvers finds large, human-like footprints at Fort Bragg. The State of this location is the North Carolina. State, the County is the Cumberland. County, the location details are described as Secured military base. and, the nearest town is Ft. Bragg, NC. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Possible vocalizations heard in Humboldt State Redwoods. The State of this location is the California. State, the County is the Humboldt. County, the location details are described as [edited -- location details removed]. and, the nearest town is [edited -- location details removed]. and the nearest road is [edited -- location details removed]."
    },
    {
        "description": "The headline of the report is Campers describe a possible approach to a camp near Lake George, Adirondacks. The State of this location is the New York. State, the County is the Warren. County, the location details are described as follow split rock road, turns to dirt, fork in road bear left, keep going into the woods, easy to find. and, the nearest town is hague. and the nearest road is split rock road."
    },
    {
        "description": "The headline of the report is Campers hear terrifying vocalizations and see a huge dark form. The State of this location is the Oregon. State, the County is the Curry. County, the location details are described as Near Babyfoot lake in the Kalmiopsis wilderness area in south coastal Oregon. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Family has several sightings at a summer cabin near Winamac. . The State of this location is the Indiana. State, the County is the Pulaski. County, the location details are described as All the sightings were near the Dentwood cabins, right off River Road, just outside of Winamac.. and, the nearest town is Winamac. and the nearest road is River Road."
    },
    {
        "description": "The headline of the report is Fisherman Observes White Creature Swimming in Antrim Lake. The State of this location is the Ohio. State, the County is the Franklin. County, the location details are described as east of rt 315 is Antrim park i was on west side of bank near parking. It came up and swam east towards the river. and, the nearest town is Columbus. and the nearest road is st. rd 315."
    },
    {
        "description": "The headline of the report is Possible vocalization heard near Woodlands Parkway . The State of this location is the Texas. State, the County is the Montgomery. County, the location details are described as There is a back entrence in to The Woodlands in this area and it is not developed. That is where it was coming from.. and, the nearest town is The Woodlands / Sping Texas. and the nearest road is Degas Park-Branch Crossing-Woodlands Parkway."
    },
    {
        "description": "The headline of the report is Possible encounters on a farm near Dry Ridge. The State of this location is the Kentucky. State, the County is the Grant. County, the location details are described as corn fields, soy beans, food plots for deer, hay, creeks and ponds, hard woods, thick cover. and, the nearest town is Dry Ridge. and the nearest road is US 25."
    },
    {
        "description": "The headline of the report is Mother and son see sasquatch closeup from road. The State of this location is the Rhode Island. State, the County is the Washington. County, the location details are described as In a development off RT 112 in Charlestown known as Five Seasons.. and, the nearest town is Charlestown. and the nearest road is Rt 112."
    },
    {
        "description": "The headline of the report is Man recalls encounter he had as a teenager near Kalkaska. The State of this location is the Michigan. State, the County is the Kalkaska. County, the location details are described as west of Twin Lakes in Kalkaska County, probably on Twin Lakes Road NE (based on the Google Earth May 12, 1994 image), east of State Highway 66. and, the nearest town is Kalkaska to southwest, Mancelona to northwest. and the nearest road is west of Twin Lakes in Kalkaska County, probably on Twin Lakes Road NE (based on the Google Earth May 12, 1994 image), east of State Highway 66."
    },
    {
        "description": "The headline of the report is Possible vocalization heard in Marion, Illinois. The State of this location is the Illinois. State, the County is the Williamson. County, the location details are described as NW corner of 511 S. Second St in Marion, IL.  A neighborhood of homes built in the mid-50s.. and, the nearest town is Marion. and the nearest road is South 2nd St."
    },
    {
        "description": "The headline of the report is Two see 7- 8 Foot Creature on dead end road. The State of this location is the New York. State, the County is the Fulton. County, the location details are described as Ok, From Johnstown Ny, take Perry st North to Maple Ave.  Turn left on Maple and follow till it you reach W. Fulton Ext.  Turn left there.  This becomes N. Bush Rd.  The dead end is off N. Bush right before an old red barn. and, the nearest town is Caroga Lake. and the nearest road is North Bush Rd."
    },
    {
        "description": "The headline of the report is Possible knocking heard in Pictured Rocks National Lakeshore. The State of this location is the Michigan. State, the County is the Alger. County, the location details are described as The sighting was approximately a third of the way down the trail as we walked in to Miner's Falls.  It was on the north side of the trail just up an incline behind a stand of four or five trees, maybe more.. and, the nearest town is Munising. and the nearest road is The road that goes by Miner's Falls to PIctured Rocks.."
    },
    {
        "description": "The headline of the report is Motorists and firefighters observe a sasquatch darting across Rt. 224 SE of Odessa. The State of this location is the New York. State, the County is the Schuyler. County, the location details are described as New York State, USA.  Approximately 1-2 miles west of Alpine Junction on Rte. 224 in Chemung County [corrected as Schuyler County, see update note in comments section]. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two boys see a large animal wading in pond near Morton. The State of this location is the Washington. State, the County is the Lewis. County, the location details are described as Quarter Mile down river from Gus Backstrom Park, South side of Hwy 508 and North of Hwy 12 and the Tilton River. Private land posted no trespassing.. and, the nearest town is Morton. and the nearest road is Between Hwy 508 and Hwy 12."
    },
    {
        "description": "The headline of the report is Snake hunter has daytime sighting near Seneca. The State of this location is the Illinois. State, the County is the Grundy. County, the location details are described as This is on private land.. and, the nearest town is Seneca. and the nearest road is IL Route 6."
    },
    {
        "description": "The headline of the report is Four friends saw and heard 8 foot creature plow through the trees while they were out fishing. The State of this location is the Texas. State, the County is the Cooke. County, the location details are described as USA Texas/Cooke Mountain springs; north side of Lake Ray Roberts. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Two teenage deer hunters have encounter while hunting. The State of this location is the Louisiana. State, the County is the La Salle. County, the location details are described as On file w/BFRO. and, the nearest town is Georgetown. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Six witnesses in three cars see a sasquatch in Big Piney Woods. The State of this location is the Texas. State, the County is the Morris. County, the location details are described as See report. and, the nearest town is Texarkana. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Large, bipedal animal crosses road in front of couple near Santa Clara River. The State of this location is the Utah. State, the County is the Washington. County, the location details are described as Near the Santa Clara River by the Shivwits Indian Reservation, on Highway 91, west of Ivins, Utah. and, the nearest town is Ivins, Utah. and the nearest road is Highway 91."
    },
    {
        "description": "The headline of the report is Man recalls scary incidents as a teenager on his family's farm SW of Mt. Pleasant. The State of this location is the Michigan. State, the County is the Montcalm. County, the location details are described as 1 mile east of flat river. and, the nearest town is Six Lakes. and the nearest road is Almy Rd.."
    },
    {
        "description": "The headline of the report is Dusk sighting in a backyard near Edwardsville. The State of this location is the Illinois. State, the County is the Madison. County, the location details are described as nan. and, the nearest town is Edwardsville. and the nearest road is Illinois Rt 143."
    },
    {
        "description": "The headline of the report is Memory told of observing a hairy biped close to Civil War fortifications near Fort Lee. The State of this location is the Virginia. State, the County is the Prince George. County, the location details are described as If you are going toward Hopewell from Petersburg on 36 there is a circular \"subdivision\" across from the gates on the left.  At the time, the basketball courts are on the northwest side and the trail into the woods runs northeast kind of parallel to 36.  The stream starts at the subdivision and runs through the woods below the earthen walls toward the northwest.  I could provide you GPS coordinates if that helped.  I can still see the area on google maps though I now live in Florida. and, the nearest town is Ft Lee Virginia. and the nearest road is Oaklawn blvd (highway 36)."
    },
    {
        "description": "The headline of the report is Audio recording of possible screams, growls, and fight with a dog from the Late 70's near Prosperity. The State of this location is the Pennsylvania. State, the County is the Washington. County, the location details are described as nan. and, the nearest town is Prosperity. and the nearest road is Pie Ridge Rd.."
    },
    {
        "description": "The headline of the report is Possible vocalizations and stick structures found in Bachelors Grove Cemetery. The State of this location is the Illinois. State, the County is the Cook. County, the location details are described as Bachelors Grove Cemetery which is near the intersection of 143rd Street and Ridgeland Avenue.. and, the nearest town is Midlothian. and the nearest road is 143rd Street."
    },
    {
        "description": "The headline of the report is Couple reports possible stalking near abandoned rural graveyard outside town of Valley. The State of this location is the Alabama. State, the County is the Lee. County, the location details are described as Take Hwy 29 East from Interstate 85  The area is near Halawakee Creek in Lee County, Alabama and is between Hwy 29 and Hwy 280 East.. and, the nearest town is Valley. and the nearest road is Intstate 85 and Hwy 29 and Hwy 280."
    },
    {
        "description": "The headline of the report is Tracks found during a nature ride near Mica Peak. The State of this location is the Idaho. State, the County is the Kootenai. County, the location details are described as About 10 miles south of Coeur d'Alene and 5 miles west of Hwy 95.. and, the nearest town is Coeur d'Alene. and the nearest road is Hwy 95."
    },
    {
        "description": "The headline of the report is Late night sighting by a stranded boater on the St. Marys River. The State of this location is the Florida. State, the County is the Nassau. County, the location details are described as I have found the location on google earth, we were at 30degrees 42'18.54\" N 82 degrees 02'16.20\"W elevation 11ft. and, the nearest town is Folkston, GA. and the nearest road is US HWY 1."
    },
    {
        "description": "The headline of the report is Passenger has possible daylight sighting near New Preston. The State of this location is the Connecticut. State, the County is the Litchfield. County, the location details are described as location: Hillside above Lake Waramog looking. and, the nearest town is New Preston, CT.. and the nearest road is Rt. 45."
    },
    {
        "description": "The headline of the report is Possible footprints found in the snow on a farm near Nashville. The State of this location is the Ohio. State, the County is the Holmes. County, the location details are described as nan. and, the nearest town is Nashville. and the nearest road is Sate Route 179."
    },
    {
        "description": "The headline of the report is Memory told of a daytime sighting near Edwardsville. The State of this location is the Illinois. State, the County is the Madison. County, the location details are described as From I-270 take Exit 9. Travel north on Illinois 157 and then continue on University Avenue. Turn left on Bluff Road at about 1 1/2 miles. Turn left at St. Paul's United Church Of Christ. Continue west along unnamed road.. and, the nearest town is Edwardsville. and the nearest road is Hwy 157 @ South University Dr (Bluff Rd)."
    },
    {
        "description": "The headline of the report is Young male hiker experiences strange events and finds possible tracks at a campground in the Blue Mountains. The State of this location is the Oregon. State, the County is the Wallowa. County, the location details are described as I set up camp at Skyline Campground (formerly Squaw Springs Campground)It is along Kendall Skyline Road. Take Mill Creek Road to Tiger Creek Rd and it is 2 or 3 miles south of where Tiger Creek Rd intersects Kendall Skyline Rd. I hiked approximately 2 miles into the Wenaha-Tucannon Wilderness. I also brought along a Garmin GPS and kept a log of my hike if someone wants to investigate the area further.. and, the nearest town is Walla Walla, WA. and the nearest road is Kendall Skyline Road."
    },
    {
        "description": "The headline of the report is Farmer hears possible nighttime vocalizations outside Errol. The State of this location is the New Hampshire. State, the County is the Coos. County, the location details are described as This happened on the farm we manage just outside of Errol, NH. We are 2.2 miles past Errol, heading towards Colebrook, NH.. and, the nearest town is Errol. and the nearest road is Rt. 26."
    },
    {
        "description": "The headline of the report is Boy Scouts have sighting while camping at Quednau Ranch. The State of this location is the Florida. State, the County is the Charlotte. County, the location details are described as Quednau Ranch in the early 1960's. and, the nearest town is Murdoch , FL. and the nearest road is Now is I-75."
    },
    {
        "description": "The headline of the report is Group of friends hear possible howls near the Ozark National Forest. The State of this location is the Arkansas. State, the County is the Pope. County, the location details are described as From I40, go north on weir road, I'm foggy on directions but it's about 15 minutes north of weir rd.. and, the nearest town is Russleville. and the nearest road is hwy 124."
    },
    {
        "description": "The headline of the report is Night driver snaps photo of bipedal animal on remote gravel road near Annapolis. The State of this location is the Missouri. State, the County is the Reynolds. County, the location details are described as County road (removed for privacy). and, the nearest town is Annapolis. and the nearest road is K highway."
    },
    {
        "description": "The headline of the report is Couple describes strange loud animal vocalization near Beavers Bend State Park. The State of this location is the Oklahoma. State, the County is the McCurtain. County, the location details are described as The cabin was located on Rose Lane at the border with Beavers Bend State Park. There was open area across the street leading to the park.. and, the nearest town is Broken Bow / Hochatown. and the nearest road is Rose Lane."
    },
    {
        "description": "The headline of the report is Creature observed walking back and forth by witnesses. The State of this location is the Alaska. State, the County is the Bethel. County, the location details are described as 45 miles by air west of Lake Iliamna, Alaska in the Mulchatna River Drainage. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Possible nighttime activity at a cabin near Phelps. The State of this location is the Wisconsin. State, the County is the Vilas. County, the location details are described as Sound came from the Northwest from the end of our road where our cabin is located.  Very wooded, dense forest, a lot of deer walk through our back yard and bed down just past the the dead end road.. and, the nearest town is Phelps, WI address. But we are far north very close to MI border and next to Ottawa National Forest. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Possible vocalizations heard near East Canyon Reservoir. The State of this location is the Utah. State, the County is the Morgan. County, the location details are described as Location is private property, directions are being witheld.. and, the nearest town is Morgan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Youths have daylight sighting in wooded area of Sarasota. The State of this location is the Florida. State, the County is the Sarasota. County, the location details are described as Southeast corner of Acorn circle; Just below and to the right of the star on this mapquest URL:(*Note - Honore Ave went through years after this incident). and, the nearest town is Sarasota. and the nearest road is Proctor Road & Acorn Circle."
    },
    {
        "description": "The headline of the report is While observing a footprint,  youth looks off the path to see shiny haired creature looking at him. The State of this location is the Kentucky. State, the County is the Powell. County, the location details are described as From Lexinton, take I-64 east until you reach the Mountain Parkway, from there just follow the signs to Slade. At Slade take Ky highway 11 2 miles to the park.. and, the nearest town is 2 miles from Slade. 52 miles southeast of Lexington. and the nearest road is Ky 11, 2 miles."
    },
    {
        "description": "The headline of the report is Daylight sighting near Happy Camp. The State of this location is the California. State, the County is the Siskiyou. County, the location details are described as Our back yard... Mountain I should say.. and, the nearest town is Happy Camp. and the nearest road is Hwy 96."
    },
    {
        "description": "The headline of the report is Ron Schaffner case report: The 1978 Minerva Flap. The State of this location is the Ohio. State, the County is the Stark. County, the location details are described as U.S. Route 30, west of Minerva, Ohio in Paris Township; Stark County. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Memory told of roadside sighting at night south of Rantoul . The State of this location is the Illinois. State, the County is the Champaign. County, the location details are described as Creature came out of ditch low to ground then stood up on two legs disappeared out of headlights into the dark.. and, the nearest town is Rantoul. and the nearest road is Country road."
    },
    {
        "description": "The headline of the report is Trucker has nighttime roadside sighting south of Colorado Springs near Ft. Carson. The State of this location is the Colorado. State, the County is the El Paso. County, the location details are described as about 5 miles south of Colorado Springs on highway 115 at the botttom of the hill on a part of the road that the locals call Red Hill.It was on the east side of the road at the end of a highway guardrail.. and, the nearest town is Colorado Springs. and the nearest road is Highway 115."
    },
    {
        "description": "The headline of the report is Hunter recalls a possible encounter during deer season near St. Helen. The State of this location is the Michigan. State, the County is the Roscommon. County, the location details are described as nan. and, the nearest town is St. Helen Michigan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is While training a U.S. Marine witnesses a large creature near Camp LeJuene. The State of this location is the North Carolina. State, the County is the Onslow. County, the location details are described as Camp Lejeune military base. and, the nearest town is Camp Lejeune (Camp Gaiger). and the nearest road is Unknown."
    },
    {
        "description": "The headline of the report is Possible activity (smell, branch twist) around residence outside Atoka. The State of this location is the Tennessee. State, the County is the Tipton. County, the location details are described as Removed at witness request.. and, the nearest town is Atoka. and the nearest road is Tracy."
    },
    {
        "description": "The headline of the report is Possible sighting by child near home outside Arnoldsberg. The State of this location is the West Virginia. State, the County is the Calhoun. County, the location details are described as Edited for privacy. and, the nearest town is Arnoldsberg WV. and the nearest road is State Route 16."
    },
    {
        "description": "The headline of the report is Hunter hears vocalizations, relates other experiences in vicinity. The State of this location is the Florida. State, the County is the Holmes. County, the location details are described as Near Pea River.. and, the nearest town is Geneva. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Hunter gets investigated while in his blind outside Bagdad. The State of this location is the Kentucky. State, the County is the Shelby. County, the location details are described as Jacksonville,outside of Bagdad, KY in north Shelby county. and, the nearest town is Bagdad. and the nearest road is Hwy. 12."
    },
    {
        "description": "The headline of the report is Wooded, rural, lake house scene of late night encounter. The State of this location is the Oklahoma. State, the County is the Caddo. County, the location details are described as 10 miles sw of caddo jake bridge (canadian river)on my land. and, the nearest town is El Reno. and the nearest road is caddo jake bridge."
    },
    {
        "description": "The headline of the report is Dog walker lady has daylight sighting of a Bigfoot in a nature preserve NW of Coolville. The State of this location is the Ohio. State, the County is the Athens. County, the location details are described as It was on our property that boarders a nature preserve [northwest of Coolville].. and, the nearest town is Athens. and the nearest road is Route 50."
    },
    {
        "description": "The headline of the report is Suburban Flower Mound resident startled by possible wood knocks close to home in early morning. The State of this location is the Texas. State, the County is the Denton. County, the location details are described as south of Argle Texas and north of Roanoke 1.8miles east off of Hwy 1171. and, the nearest town is North Roanoke, TX. and the nearest road is Hwy 377 and Hwy 1171 area."
    },
    {
        "description": "The headline of the report is Footprint found in the snow near Francesville. The State of this location is the Indiana. State, the County is the Pulaski. County, the location details are described as It is at the old Oaks Campground, the county line is less than a mile from there where it meets Jasper County.. and, the nearest town is Francesville. and the nearest road is 114."
    },
    {
        "description": "The headline of the report is Family retells documenting a possible mile-long line of tracks north of Yankeetown. The State of this location is the Florida. State, the County is the Levy. County, the location details are described as 7 - 10 miles north of Yankee Town. and, the nearest town is Yankee Town. and the nearest road is Hwy 40 - 19."
    },
    {
        "description": "The headline of the report is Couple stop at roadside viewpoint and hear vocalization near Elbe. The State of this location is the Washington. State, the County is the Pierce. County, the location details are described as Edited to protect the location. and, the nearest town is Elbe. and the nearest road is road to copper creek."
    },
    {
        "description": "The headline of the report is Person awakes to a 'howling' or 'wailing' sound just outside the house; he compares the sound to a recorded howl of a bigfoot. The State of this location is the North Carolina. State, the County is the Pender. County, the location details are described as Near Hampstead, Pender County, North Carolina. North of Wilmington, NC, on the south-east part of the state. Nearest major road is Highway 17 (Market Street).. and, the nearest town is Hampstead. and the nearest road is Highway 17 (Market Street).."
    },
    {
        "description": "The headline of the report is Mother and daughter see 9' tall white-furred creature while camping in Pisgah NF outside Brevard. The State of this location is the North Carolina. State, the County is the Transylvania. County, the location details are described as Pisgah national forest Davidson river campground. and, the nearest town is Pisgah national forest. and the nearest road is Main road through forest."
    },
    {
        "description": "The headline of the report is More sightings of a strange creature centering around the town of Ottosen. Other stories told about strange sounds, footprints and animal mutilatations. . The State of this location is the Iowa. State, the County is the Humboldt. County, the location details are described as nan. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Campers hear loud vocalizations near Kennedy Meadows. The State of this location is the California. State, the County is the Tulare. County, the location details are described as Take Sherman Pass Road past Kennedy Meadows General Store.  Continue on towards Troy Meadows. We turned on a vague dirt road within a mile of the entrance to Fish Creek Campground. Our camp was close to the old Jackass Trail connector.. and, the nearest town is Kennedy Meadows. and the nearest road is Sherman Pass Road."
    },
    {
        "description": "The headline of the report is Man describes childhood incident, a possible approach at Seven Lakes. The State of this location is the California. State, the County is the Inyo. County, the location details are described as From Big Pine, go west on Glacier Rd. The trailhead is almost at the end of the road (before Glacier Lodge). The trail goes up to the seven lakes, located in Palisades Glacier. This incident occured at the west end of sixth lake, with seven lake a short distance away.. and, the nearest town is Big Pine. and the nearest road is Hwy 395."
    },
    {
        "description": "The headline of the report is Possible sighting during BFRO's West Virginia expedition, Spring 2005. The State of this location is the West Virginia. State, the County is the Pocahontas. County, the location details are described as nan. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Experienced hunter decribes a brief standoff at approx. 80 yards, in daylight, near Smithville. The State of this location is the Oklahoma. State, the County is the McCurtain. County, the location details are described as Can show on a topo map. and, the nearest town is Smithville. and the nearest road is 285."
    },
    {
        "description": "The headline of the report is While scouting, hunter hears morning vocalization west of Scappoose. The State of this location is the Oregon. State, the County is the Columbia. County, the location details are described as Dutch Canyon Road west of Scappoose.. and, the nearest town is Scappoose. and the nearest road is Dutch Canyon Rd."
    },
    {
        "description": "The headline of the report is Truck driver has late afternoon encounter while dumping stone. The State of this location is the Pennsylvania. State, the County is the Lycoming. County, the location details are described as nan. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Campers awakened by heavy bipedal footsteps in Uwharrie National Forest. The State of this location is the North Carolina. State, the County is the Montgomery. County, the location details are described as nan. and, the nearest town is Troy. and the nearest road is 109? By Eldorado Outpost Store."
    },
    {
        "description": "The headline of the report is Missing chickens lead to discovery of large footprints by chicken coop near Bloomingdale. The State of this location is the Ohio. State, the County is the Jefferson. County, the location details are described as Right off of the Bloomingdale exit of Route 22. and, the nearest town is Bloomingdale. and the nearest road is Route 22."
    },
    {
        "description": "The headline of the report is LEO has a daylight sighting at a ranch outside Grapeland. The State of this location is the Texas. State, the County is the Houston. County, the location details are described as NE of Grapleand toward REDTOWN on county RD ..I cant remember the number 140 maybe...it was behind the Vulcraft Plant.. and, the nearest town is Grapeland TX. and the nearest road is CRD."
    },
    {
        "description": "The headline of the report is Couple finds large human-shaped footprints while elk hunting near Bear Creek. The State of this location is the Colorado. State, the County is the La Plata. County, the location details are described as The location was up Beaver Meadows off of Bear Creek. and, the nearest town is Bayfield. and the nearest road is Hwy 160."
    },
    {
        "description": "The headline of the report is Morning dog walkers hear repeated vocalizations and find scat near Oak Harbor. The State of this location is the Washington. State, the County is the Island. County, the location details are described as Private community about a mile and one half from main road (SR 20).. and, the nearest town is Oak Harbor. and the nearest road is North Harrison St.."
    },
    {
        "description": "The headline of the report is Campers hear strange vocalizations for over an hour while camping outside Dorrington. The State of this location is the California. State, the County is the Tuolumne. County, the location details are described as Big Preather Meadows, a private preserve and association.  At grandpa's request, we wish to keep the actual number to ourselves, however, I am happy to take you there if you want.  Scratch that.  My braver husband can take you there.. and, the nearest town is Dorrington, CA. and the nearest road is Forest Road 6N08, HWY 4."
    },
    {
        "description": "The headline of the report is A camp site incident with multiple witnesses. The campers were approached while they were sleeping. The State of this location is the California. State, the County is the San Bernardino. County, the location details are described as In the San Bernardino Mountains at the Barton Flats Campground, California, southwest of Big Bear Lake. I think it was off Hwy 36.. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Multiple witnesses hear possible vocalizations near Darrington. The State of this location is the Washington. State, the County is the Snohomish. County, the location details are described as [Location specifics removed at the request of witness]. and, the nearest town is Darrington. and the nearest road is [Road names removed by editor.]."
    },
    {
        "description": "The headline of the report is Footsteps heard outside of camper trailer near Bear Valley National Bald Eagle Refuge. The State of this location is the Oregon. State, the County is the Klamath. County, the location details are described as About 15 miles South Southeast of Klamath Falls, Oregon. We lived at the end of a small subdivision that was relatively new (5 years) at the time.. and, the nearest town is Keno. and the nearest road is Keno-Worden Road."
    },
    {
        "description": "The headline of the report is Motorist has possible daylight sighting near Embarras River. The State of this location is the Illinois. State, the County is the Crawford. County, the location details are described as Spencer's Bridge road south of the Embarras River.. and, the nearest town is Landes. and the nearest road is Chauncey blacktop."
    },
    {
        "description": "The headline of the report is Family has a possible nighttime encounter while in their home near Hancock. The State of this location is the New Hampshire. State, the County is the Hillsborough. County, the location details are described as Witness does not want his name or location shared.. and, the nearest town is Hancock. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Northeast Washington resident sees a bigfoot looking in the window. The State of this location is the Washington. State, the County is the Stevens. County, the location details are described as Area is located off Onion Creek Road.. and, the nearest town is Colville, Washington. and the nearest road is Onion Creek Road."
    },
    {
        "description": "The headline of the report is Climber has night-time sighting near Mt. Adams wilderness. The State of this location is the Washington. State, the County is the Skamania. County, the location details are described as One of the highest camp sites on the north side of Mt Adams, about 100m from the road and next to a small stream that flowed north. This camp site is about a five min walk from where the wilderness zone begins, and is where our truck could be parked.. and, the nearest town is Mt. Adams Wilderness Area. and the nearest road is park access road."
    },
    {
        "description": "The headline of the report is Rancher finds a large track while looking around outside at 1:00 am to see what's disturbing his horses. The State of this location is the Oregon. State, the County is the Clackamas. County, the location details are described as we live outside estacada on property that borders a national forest. it is at the foothills of the cascade mountain range.. and, the nearest town is Estacada. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Storm watchers on tower observe animal on beach. . The State of this location is the Oregon. State, the County is the Clatsop. County, the location details are described as It was at the beach area off the North Jetty at Ft. Stevens State Park,. and, the nearest town is Hammond,OR. and the nearest road is Ridge road  or Ft. Stevens road."
    },
    {
        "description": "The headline of the report is Man has late night sighting near Twain Harte. The State of this location is the California. State, the County is the Tuolumne. County, the location details are described as I've only been there twice and there are so many streets to turn too that I still have no idea how to get to the cabin.  All I know is how to get to Twain Hearts.. and, the nearest town is Twain Harte. and the nearest road is Highway 108."
    },
    {
        "description": "The headline of the report is Campers have daylight sighting near Leadville. The State of this location is the Colorado. State, the County is the Chaffee. County, the location details are described as Travel South out of Leadville Colorado about fifteen miles on U.S. 24 to Granite Colorado.  About two miles past Granite turn right (west) on Clear Creek Canyon Road.  Clear Creek Lake Reservoir is about one half mile west after you make the turn.. and, the nearest town is Granite, Colorado. and the nearest road is Clear Creek Canyon Road."
    },
    {
        "description": "The headline of the report is Motorist has two possible sightings on the Appalachian Hwy. near Gadsden. The State of this location is the Alabama. State, the County is the Etowa. County, the location details are described as Appalachian highway heading from Hokes bluff to Gadsden Alabama right pass the Appalachian bridge, between Cotes Bend and the Coosa River. and, the nearest town is Gadsden. and the nearest road is Appalachian highway."
    },
    {
        "description": "The headline of the report is Memories told of activity over several years at a family home near Oglethorpe. The State of this location is the Georgia. State, the County is the Macon. County, the location details are described as nan. and, the nearest town is oglethorpe. and the nearest road is hwy 49."
    },
    {
        "description": "The headline of the report is Man describes incidents in teen years in swamp area outside Naples. The State of this location is the Florida. State, the County is the Collier. County, the location details are described as E MAIL ME ILL TALK TO YOU. and, the nearest town is NAPLES. and the nearest road is FLORIDIAN AVE."
    },
    {
        "description": "The headline of the report is Man recalls his terrifying encounter near the Econfino State Park while camping with his family. The State of this location is the Florida. State, the County is the Taylor. County, the location details are described as HWY 98 West to the Econfina River Grade, Left on said road to Snipes Island Grade, Back near the Marshlands.. and, the nearest town is Perry, Fla. and the nearest road is US HWY 98 West."
    },
    {
        "description": "The headline of the report is Photographer spooked off Big Spirit Lake before he gets his photo. The State of this location is the Iowa. State, the County is the Dickinson. County, the location details are described as Marble beach state recreation area. and, the nearest town is Spirit Lake, IA. and the nearest road is 240th avenue."
    },
    {
        "description": "The headline of the report is Kayaker has rocks thrown and observes the culprit near Union Grove. The State of this location is the Alabama. State, the County is the Morgan. County, the location details are described as In the valley off of Greenbrier Cove Rd. close to the Tennessee river. and, the nearest town is Union grove. and the nearest road is Union Grove Road."
    },
    {
        "description": "The headline of the report is Woman hears unrecognizable vocalizations near Cle Elum. The State of this location is the Washington. State, the County is the Kittitas. County, the location details are described as nan. and, the nearest town is Cle Elum WA. and the nearest road is Hwy. 10, across the river from I-90."
    },
    {
        "description": "The headline of the report is Daylight sighting by motorist of a juvenile north of Whitehall. The State of this location is the Wisconsin. State, the County is the Trempealeau. County, the location details are described as Take Hwy.53 north out of Whittehall, to county road D north about 2 miles turn left toward the rod & gun club. go past the rod & gun. It happened on the road just before you turn the corner.. and, the nearest town is Whitehall. and the nearest road is Road was off county D."
    },
    {
        "description": "The headline of the report is Morning sighting near Pelican Lake. The State of this location is the Wisconsin. State, the County is the Langlade. County, the location details are described as Logging road near Indian land and creek deep in the woods. and, the nearest town is Pelican lake. and the nearest road is Hwy 45."
    },
    {
        "description": "The headline of the report is Possible camp stalking at Bear Island Campground in Big Cypress National Preserve. The State of this location is the Florida. State, the County is the Monroe. County, the location details are described as Black Bear Island, Campsite #4. and, the nearest town is Everglade City. and the nearest road is Hwy 29."
    },
    {
        "description": "The headline of the report is Daylight road crossing sighting by motorist in Cogar. The State of this location is the Oklahoma. State, the County is the Caddo. County, the location details are described as Go through Union City.  Get on highway 152, drive about 15 minutes until you get to the Cogar \"quick stop\" and trun left on a road.  Go straight until you get to an intersection.  (I saw it crossing from the right to the left). and, the nearest town is El Reno. and the nearest road is Highway 152."
    },
    {
        "description": "The headline of the report is Possible Sasquatch sighting by camper near Camp Cadiz in Shawnee National Forest. The State of this location is the Illinois. State, the County is the Hardin. County, the location details are described as It happened on a gravel/dirt road near the campground. [Camp Cadiz]. and, the nearest town is Elizabethtown IL. and the nearest road is Cadiz Rd, Elizabethtown IL."
    },
    {
        "description": "The headline of the report is Possible Sasquatch wood knocks in forested riverbed beside Chama during lockdown. The State of this location is the New Mexico. State, the County is the Rio Arriba. County, the location details are described as This is probably not accessible now- we were able to walk back to the area due to everything closed by COVID.  Parked at the rail yard, crossed tracks and walked through the salvage yard area (unused railway equipment).  Followed path to Chama river, crossed at a rocky ford. Continued on the path along the river approximately a quarter mile.. and, the nearest town is Chama. and the nearest road is 84."
    },
    {
        "description": "The headline of the report is Possible howl heard from Baugo Creek area in Osceola. The State of this location is the Indiana. State, the County is the Elkhart. County, the location details are described as nan. and, the nearest town is Osceola, Indiana. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Child watches fawn being chased near Canadian River. The State of this location is the Oklahoma. State, the County is the Pontotoc. County, the location details are described as One Half mile east of S.Canadian River,heavily wooded area, a lot of deer and other game. Several creeks running from here to river.. and, the nearest town is Byng. and the nearest road is State Highway 99."
    },
    {
        "description": "The headline of the report is Nighttime sighting by a motorist on a road south of Crawford. The State of this location is the Nebraska. State, the County is the Dawes. County, the location details are described as On highway NE 385 about 10 to 15 miles South of Crawford NE on a curve in the highway, south of the Cocrine Hill section of the road.. and, the nearest town is Crawford. and the nearest road is NE 385."
    },
    {
        "description": "The headline of the report is Hunter hears morning vocalization and has evening sighting north of Diamond Lake. The State of this location is the Oregon. State, the County is the Douglas. County, the location details are described as The first sounding was in the Warm Spring Creek area off NFD 600. The next day we were just off road 700 / Kelsay Mountain. The area is above the Umpqua River and about 10 miles north of Diamond Lake.. and, the nearest town is GLIDE  / LEMOLO LAKE. and the nearest road is NFD 700 / HWY.138."
    },
    {
        "description": "The headline of the report is Silhouette seen protruding above brushline near Mogadore Reservoir. . The State of this location is the Ohio. State, the County is the Portage. County, the location details are described as Relatively undeveloped country setting. Near intersection of Sunnybrook Rd and Saxe Road.. and, the nearest town is Brimfield. and the nearest road is Sunnybrook Road."
    },
    {
        "description": "The headline of the report is Nighttime sighting on CR550 outside Marquette. The State of this location is the Michigan. State, the County is the Marquette. County, the location details are described as Can not miss as 550 heads Northwest of Marquette and the landmarks are marked by signs.. and, the nearest town is Marquette, Michigan. and the nearest road is 550."
    },
    {
        "description": "The headline of the report is Motorist brakes to avoid a large hairy biped near Bristol. The State of this location is the Florida. State, the County is the Liberty. County, the location details are described as nan. and, the nearest town is Bristol. and the nearest road is CR 12 North & CR 270."
    },
    {
        "description": "The headline of the report is While driving home, witnesses observe 5-6 ft. tall hairy creature in middle of road. The State of this location is the Virginia. State, the County is the Montgomery. County, the location details are described as Dobbins Hollow Road,Montgomery County,Riner,VA. and, the nearest town is nan. and the nearest road is nan."
    },
    {
        "description": "The headline of the report is Possible footprints found in snow at a home near Lockesburg (w/photos). The State of this location is the Arkansas. State, the County is the Sevier. County, the location details are described as Tracks were heading Southwest.. and, the nearest town is Lockesburg. and the nearest road is Highway 371."
    },
    {
        "description": "The headline of the report is Memory told of a close daylight encounter while playing near Mikana. The State of this location is the Wisconsin. State, the County is the Barron. County, the location details are described as Location is near Shady Elms Resort.. and, the nearest town is Mikana. and the nearest road is Don't remember.."
    },
    {
        "description": "The headline of the report is Huge rocks thrown at night fishermen on Jewell Lake. The State of this location is the Michigan. State, the County is the Alcona. County, the location details are described as On Jewel Lake near Barton City. and, the nearest town is Barton City. and the nearest road is Stout Road."
    },
    {
        "description": "The headline of the report is Vocalizations and Footsteps heard. The State of this location is the Florida. State, the County is the Marion. County, the location details are described as nan. and, the nearest town is Summerfield. and the nearest road is SE 145 St. and 301."
    }
]